[
  {
    "company_id": "01133fe5-4172-44d0-8d1b-4af3388d95d7",
    "company_name": "Alstom SA",
    "ticker": "ALO",
    "country": "France",
    "sector": "Industrials",
    "industry": "Railroads",
    "enhanced_overview": "Alstom SA is a major industrial company headquartered in France, with expertise in Railroads. The company operates with 78,684 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Railroads, Alstom SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.353Z"
  },
  {
    "company_id": "012f8a95-4bec-4b13-b50c-5e5a78a10269",
    "company_name": "Nexans SA",
    "ticker": "NEX",
    "country": "France",
    "sector": "Industrials",
    "industry": "Electrical Equipment & Parts",
    "enhanced_overview": "Nexans SA is a major industrial company headquartered in France, with expertise in Electrical Equipment & Parts. The company operates with 28,498 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Electrical Equipment & Parts, Nexans SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "016687e0-d9b6-4b57-83c1-01f3def3a488",
    "company_name": "CPI Property Group SA",
    "ticker": "O5G",
    "country": "Luxembourg",
    "sector": "Real Estate",
    "industry": "Real Estate Services",
    "enhanced_overview": "CPI Property Group SA is a prominent real estate company headquartered in Luxembourg, specializing in Real Estate Services. The company employs 3,235 professionals in property development, management, and investment activities.",
    "business_overview": "Active in Real Estate Services, CPI Property Group SA develops, owns, and manages high-quality real estate properties. The company focuses on creating value through strategic property investments and providing excellent spaces for residential, commercial, and mixed-use purposes.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "01ac972a-0cb7-421d-bff6-faec98f07897",
    "company_name": "Siemens Healthineers AG",
    "ticker": "SHL",
    "country": "Germany",
    "sector": "Healthcare",
    "industry": "Medical Devices",
    "enhanced_overview": "Siemens Healthineers AG is a prominent healthcare company based in Germany, operating in the Medical Devices sector. The company employs 73,100 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Devices, Siemens Healthineers AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "020eb713-3e7f-4a63-8b0a-b73a309b4984",
    "company_name": "Carrefour SA",
    "ticker": "CA",
    "country": "France",
    "sector": "Consumer Defensive",
    "industry": "Grocery Stores",
    "enhanced_overview": "Carrefour SA is a major industrial company headquartered in France, with expertise in Grocery Stores. The company operates with 324,750 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Grocery Stores, Carrefour SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "022409dd-daa4-4228-86b1-4f0fd1df27e7",
    "company_name": "Brunello Cucinelli SpA",
    "ticker": "BC",
    "country": "Italy",
    "sector": "Consumer Cyclical",
    "industry": "Luxury Goods",
    "enhanced_overview": "Brunello Cucinelli SpA is a major industrial company headquartered in Italy, with expertise in Luxury Goods. The company operates with 3,101 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Luxury Goods, Brunello Cucinelli SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "032222b1-4841-4e1b-9ea2-2b9c61b0665b",
    "company_name": "Rheinmetall AG",
    "ticker": "RHM",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Aerospace & Defense",
    "enhanced_overview": "Rheinmetall AG is a major industrial company headquartered in Germany, with expertise in Aerospace & Defense. The company operates with 28,539 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Aerospace & Defense, Rheinmetall AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "034da4e8-bd6e-498c-bd09-13992aa9685a",
    "company_name": "Bilfinger SE",
    "ticker": "GBF",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "enhanced_overview": "Bilfinger SE is a major industrial company headquartered in Germany, with expertise in Engineering & Construction. The company operates with 31,478 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Engineering & Construction, Bilfinger SE delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "03bf460e-be5d-49f4-8486-96d2f85bf785",
    "company_name": "Colruyt Group NV",
    "ticker": "COLR",
    "country": "Belgium",
    "sector": "Consumer Defensive",
    "industry": "Grocery Stores",
    "enhanced_overview": "Colruyt Group NV is a major industrial company headquartered in Belgium, with expertise in Grocery Stores. The company operates with 33,000 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Grocery Stores, Colruyt Group NV delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "04f30607-36f4-45eb-89c7-dd6c109adce9",
    "company_name": "BayWa AG",
    "ticker": "BYW6",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Conglomerates",
    "enhanced_overview": "BayWa AG is a major industrial company headquartered in Germany, with expertise in Conglomerates. The company operates with 23,144 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Conglomerates, BayWa AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "05cf1dff-4e85-48a5-b0b3-b37731fef4b3",
    "company_name": "Lonza Group AG",
    "ticker": "LONN",
    "country": "Switzerland",
    "sector": "Healthcare",
    "industry": "Diagnostics & Research",
    "enhanced_overview": "Lonza Group AG is a prominent healthcare company based in Switzerland, operating in the Diagnostics & Research sector. The company employs 18,686 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Diagnostics & Research, Lonza Group AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "065f29fa-eb7b-4960-85bd-5a65f7dbbe11",
    "company_name": "Pernod Ricard SA",
    "ticker": "RI",
    "country": "France",
    "sector": "Consumer Defensive",
    "industry": "Beverages - Wineries & Distilleries",
    "enhanced_overview": "Pernod Ricard SA is a major industrial company headquartered in France, with expertise in Beverages - Wineries & Distilleries. The company operates with 19,557 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Beverages - Wineries & Distilleries, Pernod Ricard SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "06ae11c6-48fd-4840-954c-2401084ff1ba",
    "company_name": "Dermapharm Holding SE",
    "ticker": "DMP",
    "country": "Germany",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "enhanced_overview": "Dermapharm Holding SE is a prominent healthcare company based in Germany, operating in the Drug Manufacturers - Specialty & Generic sector. The company employs 3,497 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Drug Manufacturers - Specialty & Generic, Dermapharm Holding SE develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "06f85183-17b0-4064-a677-ce757c31020c",
    "company_name": "DiaSorin SpA",
    "ticker": "DIA",
    "country": "Italy",
    "sector": "Healthcare",
    "industry": "Diagnostics & Research",
    "enhanced_overview": "DiaSorin SpA is a prominent healthcare company based in Italy, operating in the Diagnostics & Research sector. The company employs 3,184 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Diagnostics & Research, DiaSorin SpA develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "07c238e7-8870-40a4-b7cb-21ad90eb2472",
    "company_name": "Poste Italiane SpA",
    "ticker": "PST",
    "country": "Italy",
    "sector": "Industrials",
    "industry": "Conglomerates",
    "enhanced_overview": "Poste Italiane SpA is a major industrial company headquartered in Italy, with expertise in Conglomerates. The company operates with 113,345 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Conglomerates, Poste Italiane SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "07ed0b5e-3b82-4195-9caa-4bfc56273089",
    "company_name": "Suedzucker AG",
    "ticker": "SZU",
    "country": "Germany",
    "sector": "Consumer Defensive",
    "industry": "Packaged Foods",
    "enhanced_overview": "Suedzucker AG is a major industrial company headquartered in Germany, with expertise in Packaged Foods. The company operates with 19,853 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Packaged Foods, Suedzucker AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "081d6973-165f-4aa4-8c73-bced373acdc5",
    "company_name": "AT & S Austria Technologie & Systemtechnik AG",
    "ticker": "ATS",
    "country": "Austria",
    "sector": "Technology",
    "industry": "Electronic Components",
    "enhanced_overview": "AT & S Austria Technologie & Systemtechnik AG is a leading technology company headquartered in Austria, specializing in Electronic Components. With approximately 13,828 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Electronic Components segment, AT & S Austria Technologie & Systemtechnik AG focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "082ede72-cf58-4746-bce1-645d4d22f28d",
    "company_name": "Accor SA",
    "ticker": "AC",
    "country": "France",
    "sector": "Consumer Cyclical",
    "industry": "Lodging",
    "enhanced_overview": "Accor SA is a major industrial company headquartered in France, with expertise in Lodging. The company operates with 19,423 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Lodging, Accor SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "087440b8-6ce5-4ddb-92de-4d8c1a7c26e4",
    "company_name": "Corporacion America Airports SA",
    "ticker": "CAAP",
    "country": "Luxembourg",
    "sector": "Industrials",
    "industry": "Airports & Air Services",
    "enhanced_overview": "Corporacion America Airports SA is a major industrial company headquartered in Luxembourg, with expertise in Airports & Air Services. The company operates with 6,100 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Airports & Air Services, Corporacion America Airports SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "09bcefff-d0a5-40da-9178-a38056166a6c",
    "company_name": "Elis SA",
    "ticker": "ELIS",
    "country": "France",
    "sector": "Industrials",
    "industry": "Specialty Business Services",
    "enhanced_overview": "Elis SA is a major industrial company headquartered in France, with expertise in Specialty Business Services. The company operates with 56,757 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Business Services, Elis SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "0a0e8adc-2157-4c57-865a-d34fdcbb6732",
    "company_name": "LEG Immobilien SE",
    "ticker": "LEG",
    "country": "Germany",
    "sector": "Real Estate",
    "industry": "Real Estate Services",
    "enhanced_overview": "LEG Immobilien SE is a prominent real estate company headquartered in Germany, specializing in Real Estate Services. The company employs 1,920 professionals in property development, management, and investment activities.",
    "business_overview": "Active in Real Estate Services, LEG Immobilien SE develops, owns, and manages high-quality real estate properties. The company focuses on creating value through strategic property investments and providing excellent spaces for residential, commercial, and mixed-use purposes.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "0a435b30-abae-4cb0-8fd5-6334eb9a330a",
    "company_name": "Ardagh Metal Packaging SA",
    "ticker": "AMBP",
    "country": "Luxembourg",
    "sector": "Consumer Cyclical",
    "industry": "Packaging & Containers",
    "enhanced_overview": "Ardagh Metal Packaging SA is a major industrial company headquartered in Luxembourg, with expertise in Packaging & Containers. The company operates with 6,330 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Packaging & Containers, Ardagh Metal Packaging SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "0a85f0ea-c3bc-40cf-b4ad-5a03a1716397",
    "company_name": "Swatch Group AG",
    "ticker": "UHR",
    "country": "Switzerland",
    "sector": "Consumer Cyclical",
    "industry": "Luxury Goods",
    "enhanced_overview": "Swatch Group AG is a major industrial company headquartered in Switzerland, with expertise in Luxury Goods. The company operates with 32,477 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Luxury Goods, Swatch Group AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "0aca1407-8b30-419c-87a2-49c327ee4541",
    "company_name": "ERG SpA",
    "ticker": "ERG",
    "country": "Italy",
    "sector": "Utilities",
    "industry": "Utilities - Renewable",
    "enhanced_overview": "ERG SpA is a major utility company based in Italy, providing essential Utilities - Renewable services. With 659 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Renewable sector, ERG SpA manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "0ad51db0-6e96-4f05-9ca7-7465f906943f",
    "company_name": "Soitec SA",
    "ticker": "SOI",
    "country": "France",
    "sector": "Technology",
    "industry": "Semiconductor Equipment & Materials",
    "enhanced_overview": "Soitec SA is a leading technology company headquartered in France, specializing in Semiconductor Equipment & Materials. With approximately 2,070 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Semiconductor Equipment & Materials segment, Soitec SA focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.355Z"
  },
  {
    "company_id": "0b5351a9-ac55-4654-ab89-6e9cb5fa7b07",
    "company_name": "Vallourec SA",
    "ticker": "VK",
    "country": "France",
    "sector": "Basic Materials",
    "industry": "Steel",
    "enhanced_overview": "Vallourec SA is a major industrial company headquartered in France, with expertise in Steel. The company operates with 14,000 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Steel, Vallourec SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "0b827d49-56be-450f-b12e-a891dbb700d5",
    "company_name": "Avolta AG",
    "ticker": "AVOL",
    "country": "Switzerland",
    "sector": "Consumer Cyclical",
    "industry": "Specialty Retail",
    "enhanced_overview": "Avolta AG is a major industrial company headquartered in Switzerland, with expertise in Specialty Retail. The company operates with 57,679 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Retail, Avolta AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "0bb87a53-5d41-4d33-abd6-68ff3e930d4a",
    "company_name": "SGL Carbon SE",
    "ticker": "SGL",
    "country": "Germany",
    "sector": "Basic Materials",
    "industry": "Chemicals",
    "enhanced_overview": "SGL Carbon SE is a major industrial company headquartered in Germany, with expertise in Chemicals. The company operates with 4,277 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Chemicals, SGL Carbon SE delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "0cc13619-cc7b-4c84-add8-9cf29ae8cbb3",
    "company_name": "Aramis Group SAS",
    "ticker": "ARAMI",
    "country": "France",
    "sector": "Consumer Cyclical",
    "industry": "Auto & Truck Dealerships",
    "enhanced_overview": "Aramis Group SAS is a major industrial company headquartered in France, with expertise in Auto & Truck Dealerships. The company operates with 2,371 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto & Truck Dealerships, Aramis Group SAS delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "0dab51ff-4410-4441-9f72-f00e8bb5514b",
    "company_name": "Dormakaba Holding AG",
    "ticker": "DOKA",
    "country": "Switzerland",
    "sector": "Industrials",
    "industry": "Building Products & Equipment",
    "enhanced_overview": "Dormakaba Holding AG is a major industrial company headquartered in Switzerland, with expertise in Building Products & Equipment. The company operates with 15,427 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Building Products & Equipment, Dormakaba Holding AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "1049604a-505c-4906-8bc7-abbb6f195490",
    "company_name": "E.ON SE",
    "ticker": "EOAN",
    "country": "Germany",
    "sector": "Utilities",
    "industry": "Utilities - Diversified",
    "enhanced_overview": "E.ON SE is a major utility company based in Germany, providing essential Utilities - Diversified services. With 69,668 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Diversified sector, E.ON SE manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "10c9e6ea-0edc-42bf-9bd0-56cfdf9240a9",
    "company_name": "Dr Ing hc F Porsche AG",
    "ticker": "P911",
    "country": "Germany",
    "sector": "Consumer Cyclical",
    "industry": "Auto Manufacturers",
    "enhanced_overview": "Dr Ing hc F Porsche AG is a major industrial company headquartered in Germany, with expertise in Auto Manufacturers. The company operates with 39,463 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto Manufacturers, Dr Ing hc F Porsche AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "11a9602f-3efa-4047-ba1c-7a2c5f7d2259",
    "company_name": "Verbund AG",
    "ticker": "VER",
    "country": "Austria",
    "sector": "Utilities",
    "industry": "Utilities - Renewable",
    "enhanced_overview": "Verbund AG is a major utility company based in Austria, providing essential Utilities - Renewable services. With 4,117 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Renewable sector, Verbund AG manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "11c2e25b-7284-4344-81c6-9b9a45f9ab97",
    "company_name": "L'Air Liquide Societe Anonyme pour l'Etude et l'Exploitation des Procedes Georges Claude SA",
    "ticker": "AI",
    "country": "France",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "L'Air Liquide Societe Anonyme pour l'Etude et l'Exploitation des Procedes Georges Claude SA is a major industrial company headquartered in France, with expertise in Specialty Chemicals. The company operates with 64,124 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, L'Air Liquide Societe Anonyme pour l'Etude et l'Exploitation des Procedes Georges Claude SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "1303a3c0-91a3-4f41-b8da-39b2d6be68a2",
    "company_name": "Nordex SE",
    "ticker": "NDX1",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "Nordex SE is a major industrial company headquartered in Germany, with expertise in Specialty Industrial Machinery. The company operates with 10,006 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, Nordex SE delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "135558f6-5774-4a3c-9574-1acac154d7f3",
    "company_name": "Vivendi SE",
    "ticker": "VIV",
    "country": "France",
    "sector": "Communication Services",
    "industry": "Entertainment",
    "enhanced_overview": "Vivendi SE is a major telecommunications and media company headquartered in France, operating in Entertainment. The company employs 2,700 professionals to deliver communication services and content to millions of customers.",
    "business_overview": "Specializing in Entertainment, Vivendi SE provides essential communication infrastructure, services, and content. The company invests in advanced technologies to enhance connectivity and deliver superior customer experiences across its service areas.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "144c0d09-5e63-4cb0-8ba9-ad5270ca9be6",
    "company_name": "Stroeer SE & Co KgaA",
    "ticker": "SAX",
    "country": "Germany",
    "sector": "Communication Services",
    "industry": "Advertising Agencies",
    "enhanced_overview": "Stroeer SE & Co KgaA is a major telecommunications and media company headquartered in Germany, operating in Advertising Agencies. The company employs 11,858 professionals to deliver communication services and content to millions of customers.",
    "business_overview": "Specializing in Advertising Agencies, Stroeer SE & Co KgaA provides essential communication infrastructure, services, and content. The company invests in advanced technologies to enhance connectivity and deliver superior customer experiences across its service areas.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "157736f9-20c4-4613-a942-d12af1de14d1",
    "company_name": "AXA SA",
    "ticker": "CS",
    "country": "France",
    "sector": "Financial Services",
    "industry": "Insurance - Diversified",
    "enhanced_overview": "AXA SA is a major financial services institution based in France, providing comprehensive Insurance - Diversified solutions. With 94,705 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Insurance - Diversified services, AXA SA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "15f8bd4a-9f24-414e-ad6e-73a3f42a65c2",
    "company_name": "Renault SA",
    "ticker": "RNO",
    "country": "France",
    "sector": "Consumer Cyclical",
    "industry": "Auto Manufacturers",
    "enhanced_overview": "Renault SA is a major industrial company headquartered in France, with expertise in Auto Manufacturers. The company operates with 98,636 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto Manufacturers, Renault SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "165fe776-a0c0-4db9-bacb-1181ff29ed1c",
    "company_name": "OC Oerlikon Corporation AG Pfaeffikon",
    "ticker": "OERL",
    "country": "Switzerland",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "OC Oerlikon Corporation AG Pfaeffikon is a major industrial company headquartered in Switzerland, with expertise in Specialty Industrial Machinery. The company operates with 12,317 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, OC Oerlikon Corporation AG Pfaeffikon delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "1689e089-c02b-4d50-8072-eb1065dcdefc",
    "company_name": "Fresenius SE & Co KGaA",
    "ticker": "FRE",
    "country": "Germany",
    "sector": "Healthcare",
    "industry": "Medical Care Facilities",
    "enhanced_overview": "Fresenius SE & Co KGaA is a prominent healthcare company based in Germany, operating in the Medical Care Facilities sector. The company employs 176,486 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Care Facilities, Fresenius SE & Co KGaA develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "17289878-c39d-4b94-952b-44146f4b3f6f",
    "company_name": "Safran SA",
    "ticker": "SAF",
    "country": "France",
    "sector": "Industrials",
    "industry": "Aerospace & Defense",
    "enhanced_overview": "Safran SA is a major industrial company headquartered in France, with expertise in Aerospace & Defense. The company operates with 96,390 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Aerospace & Defense, Safran SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "17a90809-f671-4ccc-b4e9-7345a2cad785",
    "company_name": "Siemens AG",
    "ticker": "SIE",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "Siemens AG is a major industrial company headquartered in Germany, with expertise in Specialty Industrial Machinery. The company operates with 313,000 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, Siemens AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "1809a71b-d829-4f45-9aa2-11bccd28e631",
    "company_name": "SOL SpA",
    "ticker": "SOL",
    "country": "Italy",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "SOL SpA is a major industrial company headquartered in Italy, with expertise in Specialty Chemicals. The company operates with 7,015 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, SOL SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "18c305ec-5d32-4f4f-bb42-02413218de6a",
    "company_name": "Deutsche Bank AG",
    "ticker": "DBK",
    "country": "Germany",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Deutsche Bank AG is a major financial services institution based in Germany, providing comprehensive Banks - Regional solutions. With 89,753 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Deutsche Bank AG offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "1986a42c-b764-4bf4-bbe1-1076d6a102bc",
    "company_name": "Tecan Group AG",
    "ticker": "TECN",
    "country": "Switzerland",
    "sector": "Healthcare",
    "industry": "Medical Instruments & Supplies",
    "enhanced_overview": "Tecan Group AG is a prominent healthcare company based in Switzerland, operating in the Medical Instruments & Supplies sector. The company employs 3,074 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Instruments & Supplies, Tecan Group AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "19cbc61c-d063-492a-9db6-c0cec25de4b4",
    "company_name": "Moncler SpA",
    "ticker": "MONC",
    "country": "Italy",
    "sector": "Consumer Cyclical",
    "industry": "Apparel Manufacturing",
    "enhanced_overview": "Moncler SpA is a major industrial company headquartered in Italy, with expertise in Apparel Manufacturing. The company operates with 7,354 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Apparel Manufacturing, Moncler SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "1a76fb4e-7a64-4901-86df-5a054ff9fe6a",
    "company_name": "Edison SpA",
    "ticker": "EDNR",
    "country": "Italy",
    "sector": "Energy",
    "industry": "Oil & Gas Integrated",
    "enhanced_overview": "Edison SpA is a significant energy company headquartered in Italy, focused on Oil & Gas Integrated. The company employs 5,957 professionals dedicated to providing reliable energy solutions and driving the transition to sustainable energy systems.",
    "business_overview": "Operating in the Oil & Gas Integrated sector, Edison SpA develops, produces, and distributes energy solutions to meet growing global demand. The company invests in both traditional and renewable energy technologies to ensure energy security and environmental responsibility.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "1ae33489-ce91-4a83-88f9-91c4bb8124db",
    "company_name": "Banco BPM SpA",
    "ticker": "BAMI",
    "country": "Italy",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Banco BPM SpA is a major financial services institution based in Italy, providing comprehensive Banks - Regional solutions. With 19,490 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Banco BPM SpA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "1d4329b9-7aa4-42b0-ba7c-a23d880a4b27",
    "company_name": "STRABAG SE",
    "ticker": "STR",
    "country": "Austria",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "enhanced_overview": "STRABAG SE is a major industrial company headquartered in Austria, with expertise in Engineering & Construction. The company operates with 77,337 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Engineering & Construction, STRABAG SE delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "1e13e8d4-b71e-4092-9459-272095354423",
    "company_name": "Bayerische Motoren Werke AG",
    "ticker": "BMW",
    "country": "Germany",
    "sector": "Consumer Cyclical",
    "industry": "Auto Manufacturers",
    "enhanced_overview": "Bayerische Motoren Werke AG is a major industrial company headquartered in Germany, with expertise in Auto Manufacturers. The company operates with 159,104 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto Manufacturers, Bayerische Motoren Werke AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "201761a1-61b9-4744-a3c1-92822eaf8c21",
    "company_name": "Geberit AG",
    "ticker": "GEBN",
    "country": "Switzerland",
    "sector": "Industrials",
    "industry": "Building Products & Equipment",
    "enhanced_overview": "Geberit AG is a major industrial company headquartered in Switzerland, with expertise in Building Products & Equipment. The company operates with 10,493 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Building Products & Equipment, Geberit AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "204c7ee2-f7af-408a-99e4-9dc953a6c504",
    "company_name": "JCDecaux SE",
    "ticker": "DEC",
    "country": "France",
    "sector": "Communication Services",
    "industry": "Advertising Agencies",
    "enhanced_overview": "JCDecaux SE is a major telecommunications and media company headquartered in France, operating in Advertising Agencies. The company employs 11,434 professionals to deliver communication services and content to millions of customers.",
    "business_overview": "Specializing in Advertising Agencies, JCDecaux SE provides essential communication infrastructure, services, and content. The company invests in advanced technologies to enhance connectivity and deliver superior customer experiences across its service areas.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "205c74b6-e089-4396-8b3f-c2f417d39545",
    "company_name": "Huber+Suhner AG",
    "ticker": "HUBN",
    "country": "Switzerland",
    "sector": "Technology",
    "industry": "Communication Equipment",
    "enhanced_overview": "Huber+Suhner AG is a leading technology company headquartered in Switzerland, specializing in Communication Equipment. With approximately 3,975 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Communication Equipment segment, Huber+Suhner AG focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "208fb558-1ba3-452b-a77a-5f9e6f3157d4",
    "company_name": "Schaeffler AG",
    "ticker": "SHA0",
    "country": "Germany",
    "sector": "Consumer Cyclical",
    "industry": "Auto Parts",
    "enhanced_overview": "Schaeffler AG is a major industrial company headquartered in Germany, with expertise in Auto Parts. The company operates with 83,990 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto Parts, Schaeffler AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "212cc48b-0ee4-4719-b09c-984635a858a5",
    "company_name": "ArcelorMittal SA",
    "ticker": "MT",
    "country": "Luxembourg",
    "sector": "Basic Materials",
    "industry": "Steel",
    "enhanced_overview": "ArcelorMittal SA is a major industrial company headquartered in Luxembourg, with expertise in Steel. The company operates with 125,416 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Steel, ArcelorMittal SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "222029cb-c88a-43f1-b1aa-96b5d633dda3",
    "company_name": "Verallia SA",
    "ticker": "VRLA",
    "country": "France",
    "sector": "Consumer Cyclical",
    "industry": "Packaging & Containers",
    "enhanced_overview": "Verallia SA is a major industrial company headquartered in France, with expertise in Packaging & Containers. The company operates with 11,000 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Packaging & Containers, Verallia SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "2326fad7-30fa-4cbd-bf09-1ab631dc8b26",
    "company_name": "Italian Sea Group SpA",
    "ticker": "TISG",
    "country": "Italy",
    "sector": "Consumer Cyclical",
    "industry": "Leisure",
    "enhanced_overview": "Italian Sea Group SpA is a major industrial company headquartered in Italy, with expertise in Leisure. The company operates with 613 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Leisure, Italian Sea Group SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "240aef74-19c1-45d2-ad3c-31977beaa966",
    "company_name": "Mundys SpA",
    "ticker": "ATL",
    "country": "Italy",
    "sector": "Industrials",
    "industry": "Infrastructure Operations",
    "enhanced_overview": "Mundys SpA is a major industrial company headquartered in Italy, with expertise in Infrastructure Operations. The company operates with 18,252 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Infrastructure Operations, Mundys SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "26c1e838-a90a-426f-805a-d530a1d9f64a",
    "company_name": "Societe Generale SA",
    "ticker": "GLE",
    "country": "France",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Societe Generale SA is a major financial services institution based in France, providing comprehensive Banks - Regional solutions. With 126,000 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Societe Generale SA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "26e1f4e3-d455-4b69-8453-505e6507e332",
    "company_name": "HELLA GmbH & Co KGaA",
    "ticker": "HLE",
    "country": "Germany",
    "sector": "Consumer Cyclical",
    "industry": "Auto Parts",
    "enhanced_overview": "HELLA GmbH & Co KGaA is a major industrial company headquartered in Germany, with expertise in Auto Parts. The company operates with 38,485 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto Parts, HELLA GmbH & Co KGaA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "27302833-5c7c-420a-b846-e8e685cebf44",
    "company_name": "Andritz AG",
    "ticker": "ANDR",
    "country": "Austria",
    "sector": "Industrials",
    "industry": "Industrial Distribution",
    "enhanced_overview": "Andritz AG is a major industrial company headquartered in Austria, with expertise in Industrial Distribution. The company operates with 30,003 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Industrial Distribution, Andritz AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "2780324b-cc6c-43eb-97ce-3ca835d2c2eb",
    "company_name": "Arkema SA",
    "ticker": "AKE",
    "country": "France",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "Arkema SA is a major industrial company headquartered in France, with expertise in Specialty Chemicals. The company operates with 21,082 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, Arkema SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "28294a90-4916-49d3-b107-02b75de591c4",
    "company_name": "Aedifica NV",
    "ticker": "AED",
    "country": "Belgium",
    "sector": "Real Estate",
    "industry": "REIT - Healthcare Facilities",
    "enhanced_overview": "Aedifica NV is a prominent real estate company headquartered in Belgium, specializing in REIT - Healthcare Facilities. The company employs 127 professionals in property development, management, and investment activities.",
    "business_overview": "Active in REIT - Healthcare Facilities, Aedifica NV develops, owns, and manages high-quality real estate properties. The company focuses on creating value through strategic property investments and providing excellent spaces for residential, commercial, and mixed-use purposes.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "28e3f6a7-ae4f-448e-b99d-eff95bb6063b",
    "company_name": "Daetwyler Holding AG",
    "ticker": "DAE",
    "country": "Switzerland",
    "sector": "Industrials",
    "industry": "Industrial Distribution",
    "enhanced_overview": "Daetwyler Holding AG is a major industrial company headquartered in Switzerland, with expertise in Industrial Distribution. The company operates with 8,094 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Industrial Distribution, Daetwyler Holding AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "29042a95-5e5f-4aa3-9fc0-94f13804b369",
    "company_name": "Getlink SE",
    "ticker": "GET",
    "country": "France",
    "sector": "Industrials",
    "industry": "Railroads",
    "enhanced_overview": "Getlink SE is a major industrial company headquartered in France, with expertise in Railroads. The company operates with 3,457 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Railroads, Getlink SE delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.356Z"
  },
  {
    "company_id": "291e1ec0-d8ad-4872-bf90-4e343443b1a5",
    "company_name": "Biontech SE",
    "ticker": "BNTX",
    "country": "Germany",
    "sector": "Healthcare",
    "industry": "Biotechnology",
    "enhanced_overview": "Biontech SE is a prominent healthcare company based in Germany, operating in the Biotechnology sector. The company employs 6,772 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Biotechnology, Biontech SE develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "298bfad9-40d2-4665-acee-a1e0c5d86d83",
    "company_name": "Iveco Group NV",
    "ticker": "IVG",
    "country": "Italy",
    "sector": "Industrials",
    "industry": "Farm & Heavy Construction Machinery",
    "enhanced_overview": "Iveco Group NV is a major industrial company headquartered in Italy, with expertise in Farm & Heavy Construction Machinery. The company operates with 36,046 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Farm & Heavy Construction Machinery, Iveco Group NV delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "2a6c6e64-7011-416b-86c1-3f126e8cc585",
    "company_name": "Also Holding AG",
    "ticker": "ALSN",
    "country": "Switzerland",
    "sector": "Technology",
    "industry": "Electronics & Computer Distribution",
    "enhanced_overview": "Also Holding AG is a leading technology company headquartered in Switzerland, specializing in Electronics & Computer Distribution. With approximately 4,229 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Electronics & Computer Distribution segment, Also Holding AG focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "2b1b91b7-aeaa-4c44-b213-f57619106504",
    "company_name": "BNP Paribas SA",
    "ticker": "BNP",
    "country": "France",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "BNP Paribas SA is a major financial services institution based in France, providing comprehensive Banks - Regional solutions. With 183,000 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, BNP Paribas SA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "2c6bf7b8-eded-4e4c-97e3-60c06e0345f3",
    "company_name": "Gecina SA",
    "ticker": "GFC",
    "country": "France",
    "sector": "Real Estate",
    "industry": "REIT - Office",
    "enhanced_overview": "Gecina SA is a prominent real estate company headquartered in France, specializing in REIT - Office. The company employs 473 professionals in property development, management, and investment activities.",
    "business_overview": "Active in REIT - Office, Gecina SA develops, owns, and manages high-quality real estate properties. The company focuses on creating value through strategic property investments and providing excellent spaces for residential, commercial, and mixed-use purposes.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "2e0a88db-bd21-4526-a173-f4ed7caf34f5",
    "company_name": "Talanx AG",
    "ticker": "TLX",
    "country": "Germany",
    "sector": "Financial Services",
    "industry": "Insurance - Diversified",
    "enhanced_overview": "Talanx AG is a major financial services institution based in Germany, providing comprehensive Insurance - Diversified solutions. With 28,000 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Insurance - Diversified services, Talanx AG offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "2e4148f0-1a56-4e56-9d7d-96be508dc089",
    "company_name": "Terna Rete Elettrica Nazionale SpA",
    "ticker": "TRN",
    "country": "Italy",
    "sector": "Utilities",
    "industry": "Utilities - Regulated Electric",
    "enhanced_overview": "Terna Rete Elettrica Nazionale SpA is a major utility company based in Italy, providing essential Utilities - Regulated Electric services. With 6,196 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Regulated Electric sector, Terna Rete Elettrica Nazionale SpA manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "2eea1627-9de6-485d-af1a-0b98f6306312",
    "company_name": "Ipsen SA",
    "ticker": "IPN",
    "country": "France",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "enhanced_overview": "Ipsen SA is a prominent healthcare company based in France, operating in the Drug Manufacturers - Specialty & Generic sector. The company employs 5,358 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Drug Manufacturers - Specialty & Generic, Ipsen SA develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "2f21f0e6-4aba-4cfd-8ce8-977ec381c6ef",
    "company_name": "Garofalo Health Care SpA",
    "ticker": "GHC",
    "country": "Italy",
    "sector": "Healthcare",
    "industry": "Medical Care Facilities",
    "enhanced_overview": "Garofalo Health Care SpA is a prominent healthcare company based in Italy, operating in the Medical Care Facilities sector. The company employs 2,767 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Care Facilities, Garofalo Health Care SpA develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "2f6acb20-342a-47b9-9330-4dbe1bd21c05",
    "company_name": "Salzgitter AG",
    "ticker": "SZG",
    "country": "Germany",
    "sector": "Basic Materials",
    "industry": "Steel",
    "enhanced_overview": "Salzgitter AG is a major industrial company headquartered in Germany, with expertise in Steel. The company operates with 23,868 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Steel, Salzgitter AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "2f6ea11c-6714-4fd6-8bbd-e6ac8c2ebc6b",
    "company_name": "Recordati Industria Chimica e Farmaceutica SpA",
    "ticker": "REC",
    "country": "Italy",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - General",
    "enhanced_overview": "Recordati Industria Chimica e Farmaceutica SpA is a prominent healthcare company based in Italy, operating in the Drug Manufacturers - General sector. The company employs 4,450 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Drug Manufacturers - General, Recordati Industria Chimica e Farmaceutica SpA develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "2ffb6eca-3450-463a-9f5a-e354a9d30818",
    "company_name": "Valeo SE",
    "ticker": "FR",
    "country": "France",
    "sector": "Consumer Cyclical",
    "industry": "Auto Parts",
    "enhanced_overview": "Valeo SE is a major industrial company headquartered in France, with expertise in Auto Parts. The company operates with 106,100 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto Parts, Valeo SE delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "3066fa93-5f26-47e9-a980-f469dd2606a1",
    "company_name": "Capgemini SE",
    "ticker": "CAP",
    "country": "France",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "enhanced_overview": "Capgemini SE is a leading technology company headquartered in France, specializing in Information Technology Services. With approximately 341,118 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Information Technology Services segment, Capgemini SE focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "306c728d-c4fd-4e67-8364-0f3544cbad77",
    "company_name": "SIG Group AG",
    "ticker": "SIGN",
    "country": "Switzerland",
    "sector": "Consumer Cyclical",
    "industry": "Packaging & Containers",
    "enhanced_overview": "SIG Group AG is a major industrial company headquartered in Switzerland, with expertise in Packaging & Containers. The company operates with 8,142 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Packaging & Containers, SIG Group AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "3180986c-bcb9-423d-8b55-78a4ffacf2a7",
    "company_name": "Enel SpA",
    "ticker": "ENEL",
    "country": "Italy",
    "sector": "Utilities",
    "industry": "Utilities - Diversified",
    "enhanced_overview": "Enel SpA is a major utility company based in Italy, providing essential Utilities - Diversified services. With 60,359 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Diversified sector, Enel SpA manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "31d4f8fa-d519-4dc3-8e27-962de5c33afb",
    "company_name": "Kuehne und Nagel International AG",
    "ticker": "KNIN",
    "country": "Switzerland",
    "sector": "Industrials",
    "industry": "Integrated Freight & Logistics",
    "enhanced_overview": "Kuehne und Nagel International AG is a major industrial company headquartered in Switzerland, with expertise in Integrated Freight & Logistics. The company operates with 75,241 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Integrated Freight & Logistics, Kuehne und Nagel International AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.357Z"
  },
  {
    "company_id": "33b5b9b9-8cb4-4839-ae0c-166e63e83edf",
    "company_name": "Tenaris SA",
    "ticker": "TEN",
    "country": "Luxembourg",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "enhanced_overview": "Tenaris SA is a significant energy company headquartered in Luxembourg, focused on Oil & Gas Equipment & Services. The company employs 29,134 professionals dedicated to providing reliable energy solutions and driving the transition to sustainable energy systems.",
    "business_overview": "Operating in the Oil & Gas Equipment & Services sector, Tenaris SA develops, produces, and distributes energy solutions to meet growing global demand. The company invests in both traditional and renewable energy technologies to ensure energy security and environmental responsibility.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "35f3252e-dd84-4fac-bc41-e45d5ed157c8",
    "company_name": "Titan Cement International SA",
    "ticker": "TITC",
    "country": "Belgium",
    "sector": "Basic Materials",
    "industry": "Building Materials",
    "enhanced_overview": "Titan Cement International SA is a major industrial company headquartered in Belgium, with expertise in Building Materials. The company operates with 5,700 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Building Materials, Titan Cement International SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "3618e3c4-f4b0-403c-aab8-98c6135aeb0d",
    "company_name": "Acea SpA",
    "ticker": "ACE",
    "country": "Italy",
    "sector": "Utilities",
    "industry": "Utilities - Diversified",
    "enhanced_overview": "Acea SpA is a major utility company based in Italy, providing essential Utilities - Diversified services. With 9,372 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Diversified sector, Acea SpA manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "36ab972f-70d4-49f6-8149-215e5ed3728b",
    "company_name": "Hapag-Lloyd AG",
    "ticker": "HLAG",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Marine Shipping",
    "enhanced_overview": "Hapag-Lloyd AG is a major industrial company headquartered in Germany, with expertise in Marine Shipping. The company operates with 14,608 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Marine Shipping, Hapag-Lloyd AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "38cc849d-4aa9-4748-b2c5-80dab73a542b",
    "company_name": "Brembo NV",
    "ticker": "BRE",
    "country": "Italy",
    "sector": "Consumer Cyclical",
    "industry": "Auto Parts",
    "enhanced_overview": "Brembo NV is a major industrial company headquartered in Italy, with expertise in Auto Parts. The company operates with 14,348 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto Parts, Brembo NV delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "38de0592-7b1b-414e-a65c-f79bfed9ff76",
    "company_name": "Television Francaise 1 SA",
    "ticker": "TFI",
    "country": "France",
    "sector": "Communication Services",
    "industry": "Broadcasting",
    "enhanced_overview": "Television Francaise 1 SA is a major telecommunications and media company headquartered in France, operating in Broadcasting. The company employs 3,115 professionals to deliver communication services and content to millions of customers.",
    "business_overview": "Specializing in Broadcasting, Television Francaise 1 SA provides essential communication infrastructure, services, and content. The company invests in advanced technologies to enhance connectivity and deliver superior customer experiences across its service areas.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "3de31152-c724-4b04-900b-0e64318857f3",
    "company_name": "Aroundtown SA",
    "ticker": "AT1",
    "country": "Luxembourg",
    "sector": "Real Estate",
    "industry": "Real Estate Services",
    "enhanced_overview": "Aroundtown SA is a prominent real estate company headquartered in Luxembourg, specializing in Real Estate Services. The company employs 1,506 professionals in property development, management, and investment activities.",
    "business_overview": "Active in Real Estate Services, Aroundtown SA develops, owns, and manages high-quality real estate properties. The company focuses on creating value through strategic property investments and providing excellent spaces for residential, commercial, and mixed-use purposes.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "3ef5040d-9b53-48bf-b24e-957dbf00ff60",
    "company_name": "Syensqo NV",
    "ticker": "SYENS",
    "country": "Belgium",
    "sector": "Basic Materials",
    "industry": "Chemicals",
    "enhanced_overview": "Syensqo NV is a major industrial company headquartered in Belgium, with expertise in Chemicals. The company operates with 13,000 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Chemicals, Syensqo NV delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "3ef8586d-7a18-45f1-8542-ad4bab78dbfd",
    "company_name": "Banca Popolare Di Sondrio SpA",
    "ticker": "BPSO",
    "country": "Italy",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Banca Popolare Di Sondrio SpA is a major financial services institution based in Italy, providing comprehensive Banks - Regional solutions. With 3,705 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Banca Popolare Di Sondrio SpA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "3f1e6228-63e4-47d1-8e88-0d3a60a5b656",
    "company_name": "Daimler Truck Holding AG",
    "ticker": "DTG",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Farm & Heavy Construction Machinery",
    "enhanced_overview": "Daimler Truck Holding AG is a major industrial company headquartered in Germany, with expertise in Farm & Heavy Construction Machinery. The company operates with 104,919 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Farm & Heavy Construction Machinery, Daimler Truck Holding AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "3f271f12-9932-42db-ae1c-5f6094b174f9",
    "company_name": "EVN AG",
    "ticker": "EVN",
    "country": "Austria",
    "sector": "Utilities",
    "industry": "Utilities - Diversified",
    "enhanced_overview": "EVN AG is a major utility company based in Austria, providing essential Utilities - Diversified services. With 7,695 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Diversified sector, EVN AG manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "408b3550-5889-428f-8668-a1f595aa2bd3",
    "company_name": "Roche Holding AG",
    "ticker": "ROG",
    "country": "Switzerland",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - General",
    "enhanced_overview": "Roche Holding AG is a prominent healthcare company based in Switzerland, operating in the Drug Manufacturers - General sector. The company employs 103,249 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Drug Manufacturers - General, Roche Holding AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "40986751-6c40-4a55-b628-e0a75347977a",
    "company_name": "Prosiebensat 1 Media SE",
    "ticker": "PSM",
    "country": "Germany",
    "sector": "Communication Services",
    "industry": "Broadcasting",
    "enhanced_overview": "Prosiebensat 1 Media SE is a major telecommunications and media company headquartered in Germany, operating in Broadcasting. The company employs 6,068 professionals to deliver communication services and content to millions of customers.",
    "business_overview": "Specializing in Broadcasting, Prosiebensat 1 Media SE provides essential communication infrastructure, services, and content. The company invests in advanced technologies to enhance connectivity and deliver superior customer experiences across its service areas.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "41dececd-42cd-4286-a9b9-af64ab395f28",
    "company_name": "Hugo Boss AG",
    "ticker": "BOSS",
    "country": "Germany",
    "sector": "Consumer Cyclical",
    "industry": "Apparel Manufacturing",
    "enhanced_overview": "Hugo Boss AG is a major industrial company headquartered in Germany, with expertise in Apparel Manufacturing. The company operates with 18,623 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Apparel Manufacturing, Hugo Boss AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "42338ca8-27ff-4a4f-ad87-bd72a42b0a45",
    "company_name": "GEA Group AG",
    "ticker": "G1A",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "GEA Group AG is a major industrial company headquartered in Germany, with expertise in Specialty Industrial Machinery. The company operates with 18,347 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, GEA Group AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "42a5b2c9-6017-4d68-8a97-b15413156726",
    "company_name": "Helvetia Holding AG",
    "ticker": "HELN",
    "country": "Switzerland",
    "sector": "Financial Services",
    "industry": "Insurance - Diversified",
    "enhanced_overview": "Helvetia Holding AG is a major financial services institution based in Switzerland, providing comprehensive Insurance - Diversified solutions. With 14,104 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Insurance - Diversified services, Helvetia Holding AG offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "42a854ca-89d2-4f26-a8fb-3f3e671ed372",
    "company_name": "Fuchs Se",
    "ticker": "FPE3",
    "country": "Germany",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "Fuchs Se is a major industrial company headquartered in Germany, with expertise in Specialty Chemicals. The company operates with 6,781 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, Fuchs Se delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "43b55ab7-6641-4cf2-b6b0-83ee29d6fce4",
    "company_name": "Deutsche Lufthansa AG",
    "ticker": "LHA",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Airlines",
    "enhanced_overview": "Deutsche Lufthansa AG is a major industrial company headquartered in Germany, with expertise in Airlines. The company operates with 66,111 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Airlines, Deutsche Lufthansa AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "43ff4277-2f66-4c85-823b-4e29feb56793",
    "company_name": "Buzzi SpA",
    "ticker": "BZU",
    "country": "Italy",
    "sector": "Basic Materials",
    "industry": "Building Materials",
    "enhanced_overview": "Buzzi SpA is a major industrial company headquartered in Italy, with expertise in Building Materials. The company operates with 9,843 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Building Materials, Buzzi SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "4580ae0b-efcd-41a8-b9db-14dd1eb98261",
    "company_name": "Rational AG",
    "ticker": "RAA",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "Rational AG is a major industrial company headquartered in Germany, with expertise in Specialty Industrial Machinery. The company operates with 2,690 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, Rational AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "45b120f0-8bff-4e2b-b74a-f32503937ece",
    "company_name": "Bayer AG",
    "ticker": "BAYN",
    "country": "Germany",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - General",
    "enhanced_overview": "Bayer AG is a prominent healthcare company based in Germany, operating in the Drug Manufacturers - General sector. The company employs 90,587 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Drug Manufacturers - General, Bayer AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "49053b92-5ecb-4f46-ab5c-cf9b62c0d7fd",
    "company_name": "ams-OSRAM AG",
    "ticker": "AMS",
    "country": "Austria",
    "sector": "Technology",
    "industry": "Semiconductors",
    "enhanced_overview": "ams-OSRAM AG is a leading technology company headquartered in Austria, specializing in Semiconductors. With approximately 19,665 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Semiconductors segment, ams-OSRAM AG focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "4948789a-3bcf-473d-a19b-fb1e0f705d89",
    "company_name": "Sartorius AG",
    "ticker": "SRT",
    "country": "Germany",
    "sector": "Healthcare",
    "industry": "Medical Instruments & Supplies",
    "enhanced_overview": "Sartorius AG is a prominent healthcare company based in Germany, operating in the Medical Instruments & Supplies sector. The company employs 12,826 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Instruments & Supplies, Sartorius AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "49bed3d6-e45f-4569-809e-4f1bd256ed81",
    "company_name": "Givaudan SA",
    "ticker": "GIVN",
    "country": "Switzerland",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "Givaudan SA is a major industrial company headquartered in Switzerland, with expertise in Specialty Chemicals. The company operates with 16,942 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, Givaudan SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "49c9b2c1-3b21-4ccb-800f-bc6cb67f426d",
    "company_name": "InPost SA",
    "ticker": "INPST",
    "country": "Luxembourg",
    "sector": "Industrials",
    "industry": "Specialty Business Services",
    "enhanced_overview": "InPost SA is a major industrial company headquartered in Luxembourg, with expertise in Specialty Business Services. The company operates with 6,950 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Business Services, InPost SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "4abcd2a6-43a9-462d-947a-6aaa4fe098f2",
    "company_name": "Danone SA",
    "ticker": "BN",
    "country": "France",
    "sector": "Consumer Defensive",
    "industry": "Packaged Foods",
    "enhanced_overview": "Danone SA is a major industrial company headquartered in France, with expertise in Packaged Foods. The company operates with 89,528 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Packaged Foods, Danone SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "4b54ce23-9442-4963-a0e4-6a8e0c981e62",
    "company_name": "voestalpine AG",
    "ticker": "VOE",
    "country": "Austria",
    "sector": "Basic Materials",
    "industry": "Steel",
    "enhanced_overview": "voestalpine AG is a major industrial company headquartered in Austria, with expertise in Steel. The company operates with 50,670 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Steel, voestalpine AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "4c714335-6ca7-42c7-a0fe-9a18c671c57d",
    "company_name": "Schindler Holding AG",
    "ticker": "SCHP",
    "country": "Switzerland",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "Schindler Holding AG is a major industrial company headquartered in Switzerland, with expertise in Specialty Industrial Machinery. The company operates with 69,326 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, Schindler Holding AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "4f0987eb-3dcc-483f-bb7c-6c4744eca7f2",
    "company_name": "Georg Fischer AG",
    "ticker": "GF",
    "country": "Switzerland",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "Georg Fischer AG is a major industrial company headquartered in Switzerland, with expertise in Specialty Industrial Machinery. The company operates with 19,023 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, Georg Fischer AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "4fb3cb8e-7ff2-4361-a215-27d0d7d8c0d1",
    "company_name": "Symrise AG",
    "ticker": "SY1",
    "country": "Germany",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "Symrise AG is a major industrial company headquartered in Germany, with expertise in Specialty Chemicals. The company operates with 12,659 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, Symrise AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "4fc198aa-d153-4afb-9465-8cd6b59e2115",
    "company_name": "Knorr Bremse AG",
    "ticker": "KBX",
    "country": "Germany",
    "sector": "Consumer Cyclical",
    "industry": "Auto Parts",
    "enhanced_overview": "Knorr Bremse AG is a major industrial company headquartered in Germany, with expertise in Auto Parts. The company operates with 29,051 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto Parts, Knorr Bremse AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "50c7b291-83f2-40b6-be44-32b19390090d",
    "company_name": "Flughafen Zuerich AG",
    "ticker": "FHZN",
    "country": "Switzerland",
    "sector": "Industrials",
    "industry": "Airports & Air Services",
    "enhanced_overview": "Flughafen Zuerich AG is a major industrial company headquartered in Switzerland, with expertise in Airports & Air Services. The company operates with 1,764 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Airports & Air Services, Flughafen Zuerich AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "514dbaf6-dd56-4d35-b8e6-a5dc586da343",
    "company_name": "Unipol Assicurazioni SpA",
    "ticker": "UNI",
    "country": "Italy",
    "sector": "Financial Services",
    "industry": "Insurance - Diversified",
    "enhanced_overview": "Unipol Assicurazioni SpA is a major financial services institution based in Italy, providing comprehensive Insurance - Diversified solutions. With 11,467 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Insurance - Diversified services, Unipol Assicurazioni SpA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.358Z"
  },
  {
    "company_id": "51751f8b-5015-41a7-9fba-d5d1be509d32",
    "company_name": "Rexel SA",
    "ticker": "RXL",
    "country": "France",
    "sector": "Technology",
    "industry": "Electronics & Computer Distribution",
    "enhanced_overview": "Rexel SA is a leading technology company headquartered in France, specializing in Electronics & Computer Distribution. With approximately 26,706 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Electronics & Computer Distribution segment, Rexel SA focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "51a8c212-4798-4411-bb92-236fbe9ae015",
    "company_name": "Edenred SE",
    "ticker": "EDEN",
    "country": "France",
    "sector": "Financial Services",
    "industry": "Credit Services",
    "enhanced_overview": "Edenred SE is a major financial services institution based in France, providing comprehensive Credit Services solutions. With 12,320 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Credit Services services, Edenred SE offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "549dcf59-2cdd-4ee7-9f73-0e3ebd90e5e9",
    "company_name": "Amplifon SpA",
    "ticker": "AMP",
    "country": "Italy",
    "sector": "Healthcare",
    "industry": "Medical Distribution",
    "enhanced_overview": "Amplifon SpA is a prominent healthcare company based in Italy, operating in the Medical Distribution sector. The company employs 11,603 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Distribution, Amplifon SpA develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "562cd299-8132-4ce2-9562-84a29b47d875",
    "company_name": "DSM-Firmenich AG",
    "ticker": "DSFIR",
    "country": "Switzerland",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "DSM-Firmenich AG is a major industrial company headquartered in Switzerland, with expertise in Specialty Chemicals. The company operates with 28,214 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, DSM-Firmenich AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "56815230-f9a9-43f3-a9c9-806bd509d025",
    "company_name": "St Galler Kantonalbank AG",
    "ticker": "SGKN",
    "country": "Switzerland",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "St Galler Kantonalbank AG is a major financial services institution based in Switzerland, providing comprehensive Banks - Regional solutions. With 885 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, St Galler Kantonalbank AG offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "571e2b11-5b33-4eaa-b514-b67cab372cf9",
    "company_name": "Bper Banca SpA",
    "ticker": "BPE",
    "country": "Italy",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Bper Banca SpA is a major financial services institution based in Italy, providing comprehensive Banks - Regional solutions. With 19,508 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Bper Banca SpA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "5789fd98-e249-48ca-b140-11172ec71e3f",
    "company_name": "Kering SA",
    "ticker": "KER",
    "country": "France",
    "sector": "Consumer Cyclical",
    "industry": "Luxury Goods",
    "enhanced_overview": "Kering SA is a major industrial company headquartered in France, with expertise in Luxury Goods. The company operates with 44,627 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Luxury Goods, Kering SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "57fdd78c-ca3d-43cb-b36d-4d5bb8669619",
    "company_name": "Ageas SA",
    "ticker": "AGS",
    "country": "Belgium",
    "sector": "Financial Services",
    "industry": "Insurance - Diversified",
    "enhanced_overview": "Ageas SA is a major financial services institution based in Belgium, providing comprehensive Insurance - Diversified solutions. With 14,837 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Insurance - Diversified services, Ageas SA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "58438df4-18e7-4f06-8312-b024e4dde3b4",
    "company_name": "R Stahl AG",
    "ticker": "RSL2",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "R Stahl AG is a major industrial company headquartered in Germany, with expertise in Specialty Industrial Machinery. The company operates with 1,761 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, R Stahl AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "588fa927-137c-40bd-a779-fa0d13df4d09",
    "company_name": "Christian Dior SE",
    "ticker": "CDI",
    "country": "France",
    "sector": "Consumer Cyclical",
    "industry": "Luxury Goods",
    "enhanced_overview": "Christian Dior SE is a major industrial company headquartered in France, with expertise in Luxury Goods. The company operates with 215,000 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Luxury Goods, Christian Dior SE delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "5abb3dcd-d9ff-4f2f-bfdc-05165341cf7a",
    "company_name": "EssilorLuxottica SA",
    "ticker": "EL",
    "country": "France",
    "sector": "Healthcare",
    "industry": "Medical Instruments & Supplies",
    "enhanced_overview": "EssilorLuxottica SA is a prominent healthcare company based in France, operating in the Medical Instruments & Supplies sector. The company employs 153,498 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Instruments & Supplies, EssilorLuxottica SA develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "5bc2d89a-48c9-46bf-b730-27112e3912f7",
    "company_name": "Allegro.eu SA",
    "ticker": "ALE",
    "country": "Luxembourg",
    "sector": "Unknown",
    "industry": "Unknown",
    "enhanced_overview": "Allegro.eu SA is a major industrial company headquartered in Luxembourg, with expertise in Unknown. The company operates with 0 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Unknown, Allegro.eu SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "5c6d0543-fe7d-4ad4-957a-dc7571bfa265",
    "company_name": "SCHOTT Pharma AG & Co KgaA",
    "ticker": "1SXP",
    "country": "Germany",
    "sector": "Healthcare",
    "industry": "Medical Instruments & Supplies",
    "enhanced_overview": "SCHOTT Pharma AG & Co KgaA is a prominent healthcare company based in Germany, operating in the Medical Instruments & Supplies sector. The company employs 4,749 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Instruments & Supplies, SCHOTT Pharma AG & Co KgaA develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "5c76853e-a9fd-4644-a7cf-2a43ecf933b0",
    "company_name": "Galenica AG",
    "ticker": "GALE",
    "country": "Switzerland",
    "sector": "Healthcare",
    "industry": "Medical Distribution",
    "enhanced_overview": "Galenica AG is a prominent healthcare company based in Switzerland, operating in the Medical Distribution sector. The company employs 4,511 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Distribution, Galenica AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "5cc2057c-7f6f-4374-a748-9c2cd2d833c1",
    "company_name": "Orange SA",
    "ticker": "ORA",
    "country": "France",
    "sector": "Communication Services",
    "industry": "Telecom Services",
    "enhanced_overview": "Orange SA is a major telecommunications and media company headquartered in France, operating in Telecom Services. The company employs 126,909 professionals to deliver communication services and content to millions of customers.",
    "business_overview": "Specializing in Telecom Services, Orange SA provides essential communication infrastructure, services, and content. The company invests in advanced technologies to enhance connectivity and deliver superior customer experiences across its service areas.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "5d31c9a6-5471-4778-a0b0-6381fc3e6107",
    "company_name": "ID Logistics Group SA",
    "ticker": "N/A",
    "country": "France",
    "sector": "Unknown",
    "industry": "Unknown",
    "enhanced_overview": "ID Logistics Group SA is a major industrial company headquartered in France, with expertise in Unknown. The company operates with 0 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Unknown, ID Logistics Group SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "5ec560cb-5380-4160-9d46-f358af1ee320",
    "company_name": "Aptiv PLC",
    "ticker": "APTV",
    "country": "Switzerland",
    "sector": "Consumer Cyclical",
    "industry": "Auto Parts",
    "enhanced_overview": "Aptiv PLC is a major industrial company headquartered in Switzerland, with expertise in Auto Parts. The company operates with 141,000 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto Parts, Aptiv PLC delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "603366ed-d968-48e1-9abd-0e0f4ea1263c",
    "company_name": "Biomerieux SA",
    "ticker": "BIM",
    "country": "France",
    "sector": "Healthcare",
    "industry": "Diagnostics & Research",
    "enhanced_overview": "Biomerieux SA is a prominent healthcare company based in France, operating in the Diagnostics & Research sector. The company employs 14,147 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Diagnostics & Research, Biomerieux SA develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "60f6f823-3747-46a6-a917-6f798b866a12",
    "company_name": "Sulzer AG",
    "ticker": "SUN",
    "country": "Switzerland",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "Sulzer AG is a major industrial company headquartered in Switzerland, with expertise in Specialty Industrial Machinery. The company operates with 13,455 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, Sulzer AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "6161b305-e4ee-4d6e-829f-59b6fad55553",
    "company_name": "Straumann Holding AG",
    "ticker": "STMN",
    "country": "Switzerland",
    "sector": "Healthcare",
    "industry": "Medical Instruments & Supplies",
    "enhanced_overview": "Straumann Holding AG is a prominent healthcare company based in Switzerland, operating in the Medical Instruments & Supplies sector. The company employs 11,342 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Instruments & Supplies, Straumann Holding AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "6223b4bb-87d0-4d9d-8908-99a3911b5896",
    "company_name": "Swiss Prime Site AG",
    "ticker": "SPSN",
    "country": "Switzerland",
    "sector": "Real Estate",
    "industry": "Real Estate - Diversified",
    "enhanced_overview": "Swiss Prime Site AG is a prominent real estate company headquartered in Switzerland, specializing in Real Estate - Diversified. The company employs 512 professionals in property development, management, and investment activities.",
    "business_overview": "Active in Real Estate - Diversified, Swiss Prime Site AG develops, owns, and manages high-quality real estate properties. The company focuses on creating value through strategic property investments and providing excellent spaces for residential, commercial, and mixed-use purposes.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "63593639-20dc-4014-91b7-70dde7636170",
    "company_name": "Interparfums SA",
    "ticker": "ITP",
    "country": "France",
    "sector": "Consumer Defensive",
    "industry": "Household & Personal Products",
    "enhanced_overview": "Interparfums SA is a major industrial company headquartered in France, with expertise in Household & Personal Products. The company operates with 346 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Household & Personal Products, Interparfums SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "64130171-4b15-46a9-b7b9-b3a0fbc4dae7",
    "company_name": "UBS Group AG",
    "ticker": "UBSG",
    "country": "Switzerland",
    "sector": "Financial Services",
    "industry": "Banks - Diversified",
    "enhanced_overview": "UBS Group AG is a major financial services institution based in Switzerland, providing comprehensive Banks - Diversified solutions. With 108,648 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Diversified services, UBS Group AG offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "64679b13-22fe-4da9-a01b-bae2c11d3e74",
    "company_name": "Banca Mediolanum SpA",
    "ticker": "BMED",
    "country": "Italy",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Banca Mediolanum SpA is a major financial services institution based in Italy, providing comprehensive Banks - Regional solutions. With 3,799 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Banca Mediolanum SpA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "64c323e6-bdb0-46fa-b398-5cfea2876e4e",
    "company_name": "Virbac SA",
    "ticker": "VIRP",
    "country": "France",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - General",
    "enhanced_overview": "Virbac SA is a prominent healthcare company based in France, operating in the Drug Manufacturers - General sector. The company employs 5,620 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Drug Manufacturers - General, Virbac SA develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "65cac45b-de11-46d3-9d79-c130a298eaa1",
    "company_name": "Bollore SE",
    "ticker": "BOL",
    "country": "France",
    "sector": "Communication Services",
    "industry": "Entertainment",
    "enhanced_overview": "Bollore SE is a major telecommunications and media company headquartered in France, operating in Entertainment. The company employs 79,405 professionals to deliver communication services and content to millions of customers.",
    "business_overview": "Specializing in Entertainment, Bollore SE provides essential communication infrastructure, services, and content. The company invests in advanced technologies to enhance connectivity and deliver superior customer experiences across its service areas.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "66b70057-54a3-41b9-bacd-3fb7c87f3f8a",
    "company_name": "Henkel AG & Co KGaA",
    "ticker": "HEN3",
    "country": "Germany",
    "sector": "Consumer Defensive",
    "industry": "Household & Personal Products",
    "enhanced_overview": "Henkel AG & Co KGaA is a major industrial company headquartered in Germany, with expertise in Household & Personal Products. The company operates with 47,150 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Household & Personal Products, Henkel AG & Co KGaA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "677588f3-855d-4d25-8baa-479541a90912",
    "company_name": "Orion SA",
    "ticker": "OEC",
    "country": "Luxembourg",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "Orion SA is a major industrial company headquartered in Luxembourg, with expertise in Specialty Chemicals. The company operates with 1,650 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, Orion SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "67d3d788-cb2e-4b0a-a007-02409a8b1949",
    "company_name": "Azelis Group NV",
    "ticker": "AZE",
    "country": "Belgium",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "Azelis Group NV is a major industrial company headquartered in Belgium, with expertise in Specialty Chemicals. The company operates with 4,321 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, Azelis Group NV delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "68d3e46d-8a15-45d3-8423-630d8594efd3",
    "company_name": "BASF SE",
    "ticker": "BAS",
    "country": "Germany",
    "sector": "Basic Materials",
    "industry": "Chemicals",
    "enhanced_overview": "BASF SE is a major industrial company headquartered in Germany, with expertise in Chemicals. The company operates with 109,717 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Chemicals, BASF SE delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "6bf0e683-d1f0-4e02-816f-d30e5958f345",
    "company_name": "Lanxess AG",
    "ticker": "LXS",
    "country": "Germany",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "Lanxess AG is a major industrial company headquartered in Germany, with expertise in Specialty Chemicals. The company operates with 12,849 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, Lanxess AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "6cb189f4-191c-40b6-bd5f-ec9fb1f780f8",
    "company_name": "RWE AG",
    "ticker": "RWE",
    "country": "Germany",
    "sector": "Utilities",
    "industry": "Utilities - Diversified",
    "enhanced_overview": "RWE AG is a major utility company based in Germany, providing essential Utilities - Diversified services. With 20,985 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Diversified sector, RWE AG manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "70054040-7e7e-4146-9b48-3f66eb2cebd9",
    "company_name": "SAP SE",
    "ticker": "SAP",
    "country": "Germany",
    "sector": "Technology",
    "industry": "Software - Application",
    "enhanced_overview": "SAP SE is a leading technology company headquartered in Germany, specializing in Software - Application. With approximately 109,121 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Software - Application segment, SAP SE focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "7060ec29-cd05-476e-97b8-32aefd2b7fbb",
    "company_name": "Dottikon Es Holding AG",
    "ticker": "DESN",
    "country": "Switzerland",
    "sector": "Basic Materials",
    "industry": "Chemicals",
    "enhanced_overview": "Dottikon Es Holding AG is a major industrial company headquartered in Switzerland, with expertise in Chemicals. The company operates with 770 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Chemicals, Dottikon Es Holding AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "725b3284-898e-4b72-9aca-d8cc7e0f8031",
    "company_name": "Ferrari NV",
    "ticker": "RACE",
    "country": "Italy",
    "sector": "Consumer Cyclical",
    "industry": "Auto Manufacturers",
    "enhanced_overview": "Ferrari NV is a major industrial company headquartered in Italy, with expertise in Auto Manufacturers. The company operates with 5,435 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto Manufacturers, Ferrari NV delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "72981bb3-1d70-4f5b-b5e7-5ec9e3277f7b",
    "company_name": "Prada SpA",
    "ticker": "1913",
    "country": "Italy",
    "sector": "Consumer Cyclical",
    "industry": "Luxury Goods",
    "enhanced_overview": "Prada SpA is a major industrial company headquartered in Italy, with expertise in Luxury Goods. The company operates with 14,876 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Luxury Goods, Prada SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "72c5bd29-017b-4fbe-bb12-92c29cf81925",
    "company_name": "Telecom Italia SpA",
    "ticker": "TIT",
    "country": "Italy",
    "sector": "Communication Services",
    "industry": "Telecom Services",
    "enhanced_overview": "Telecom Italia SpA is a major telecommunications and media company headquartered in Italy, operating in Telecom Services. The company employs 26,824 professionals to deliver communication services and content to millions of customers.",
    "business_overview": "Specializing in Telecom Services, Telecom Italia SpA provides essential communication infrastructure, services, and content. The company invests in advanced technologies to enhance connectivity and deliver superior customer experiences across its service areas.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "738b77ae-2939-4408-903b-fc5478ef2f0d",
    "company_name": "TE Connectivity Ltd",
    "ticker": "TEL",
    "country": "Switzerland",
    "sector": "Technology",
    "industry": "Electronic Components",
    "enhanced_overview": "TE Connectivity Ltd is a leading technology company headquartered in Switzerland, specializing in Electronic Components. With approximately 85,000 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Electronic Components segment, TE Connectivity Ltd focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "76000c5e-062d-4f65-b38d-b74ecc8adb22",
    "company_name": "Rubis SCA",
    "ticker": "RUI",
    "country": "France",
    "sector": "Energy",
    "industry": "Oil & Gas Refining & Marketing",
    "enhanced_overview": "Rubis SCA is a significant energy company headquartered in France, focused on Oil & Gas Refining & Marketing. The company employs 4,594 professionals dedicated to providing reliable energy solutions and driving the transition to sustainable energy systems.",
    "business_overview": "Operating in the Oil & Gas Refining & Marketing sector, Rubis SCA develops, produces, and distributes energy solutions to meet growing global demand. The company invests in both traditional and renewable energy technologies to ensure energy security and environmental responsibility.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "768dffd9-09f5-4350-8e83-c00b6645cfd0",
    "company_name": "Banca Generali SpA",
    "ticker": "BGN",
    "country": "Italy",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Banca Generali SpA is a major financial services institution based in Italy, providing comprehensive Banks - Regional solutions. With 1,041 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Banca Generali SpA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "770c4933-1358-4189-97ca-ee647c0f5dd9",
    "company_name": "Hensoldt AG",
    "ticker": "HAG",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Aerospace & Defense",
    "enhanced_overview": "Hensoldt AG is a major industrial company headquartered in Germany, with expertise in Aerospace & Defense. The company operates with 6,907 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Aerospace & Defense, Hensoldt AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "7964ba46-8707-49d3-8de1-9d186df05450",
    "company_name": "Imerys SA",
    "ticker": "NK",
    "country": "France",
    "sector": "Basic Materials",
    "industry": "Building Materials",
    "enhanced_overview": "Imerys SA is a major industrial company headquartered in France, with expertise in Building Materials. The company operates with 15,060 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Building Materials, Imerys SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "798f922d-81c7-40bc-9400-47075e5c91cd",
    "company_name": "Volkswagen AG",
    "ticker": "VOW",
    "country": "Germany",
    "sector": "Consumer Cyclical",
    "industry": "Auto Manufacturers",
    "enhanced_overview": "Volkswagen AG is a major industrial company headquartered in Germany, with expertise in Auto Manufacturers. The company operates with 679,472 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto Manufacturers, Volkswagen AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "7a1533de-9c98-48ac-9855-2fd9fa5cd3bc",
    "company_name": "Emmi AG",
    "ticker": "EMMN",
    "country": "Switzerland",
    "sector": "Consumer Defensive",
    "industry": "Packaged Foods",
    "enhanced_overview": "Emmi AG is a major industrial company headquartered in Switzerland, with expertise in Packaged Foods. The company operates with 8,821 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Packaged Foods, Emmi AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "7aff31e9-3d74-40d1-8479-0d47cfb780ff",
    "company_name": "A2A SpA",
    "ticker": "A2A",
    "country": "Italy",
    "sector": "Utilities",
    "industry": "Utilities - Diversified",
    "enhanced_overview": "A2A SpA is a major utility company based in Italy, providing essential Utilities - Diversified services. With 14,777 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Diversified sector, A2A SpA manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "7c391795-03a1-4b56-aefa-63be3b5533b9",
    "company_name": "Compagnie Financiere Richemont SA",
    "ticker": "CFR",
    "country": "Switzerland",
    "sector": "Consumer Cyclical",
    "industry": "Luxury Goods",
    "enhanced_overview": "Compagnie Financiere Richemont SA is a major industrial company headquartered in Switzerland, with expertise in Luxury Goods. The company operates with 37,117 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Luxury Goods, Compagnie Financiere Richemont SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "7f1a648a-c27f-4fb8-bbe8-5f310879f881",
    "company_name": "Vetropack Holding SA",
    "ticker": "VETN",
    "country": "Switzerland",
    "sector": "Consumer Cyclical",
    "industry": "Packaging & Containers",
    "enhanced_overview": "Vetropack Holding SA is a major industrial company headquartered in Switzerland, with expertise in Packaging & Containers. The company operates with 3,727 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Packaging & Containers, Vetropack Holding SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "80208db5-97b7-42d3-88c4-da4d345cf734",
    "company_name": "UniCredit SpA",
    "ticker": "UCG",
    "country": "Italy",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "UniCredit SpA is a major financial services institution based in Italy, providing comprehensive Banks - Regional solutions. With 70,752 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, UniCredit SpA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "8042ad84-7b00-44b9-b4ef-4a0234f2204b",
    "company_name": "Gaztransport et Technigaz SA",
    "ticker": "GTT",
    "country": "France",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "enhanced_overview": "Gaztransport et Technigaz SA is a significant energy company headquartered in France, focused on Oil & Gas Equipment & Services. The company employs 736 professionals dedicated to providing reliable energy solutions and driving the transition to sustainable energy systems.",
    "business_overview": "Operating in the Oil & Gas Equipment & Services sector, Gaztransport et Technigaz SA develops, produces, and distributes energy solutions to meet growing global demand. The company invests in both traditional and renewable energy technologies to ensure energy security and environmental responsibility.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "80a09406-f443-47ab-8be2-13051d0955ec",
    "company_name": "Wienerberger AG",
    "ticker": "WIE",
    "country": "Austria",
    "sector": "Basic Materials",
    "industry": "Building Materials",
    "enhanced_overview": "Wienerberger AG is a major industrial company headquartered in Austria, with expertise in Building Materials. The company operates with 20,462 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Building Materials, Wienerberger AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "82606ae0-96ce-4bf9-9d1c-46e4bf56beb8",
    "company_name": "Julius Baer Gruppe AG",
    "ticker": "BAER",
    "country": "Switzerland",
    "sector": "Financial Services",
    "industry": "Asset Management",
    "enhanced_overview": "Julius Baer Gruppe AG is a major financial services institution based in Switzerland, providing comprehensive Asset Management solutions. With 7,595 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Asset Management services, Julius Baer Gruppe AG offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.359Z"
  },
  {
    "company_id": "842e3076-7161-4aac-8601-e855cc26905e",
    "company_name": "Leoni AG",
    "ticker": "LEO",
    "country": "Germany",
    "sector": "Unknown",
    "industry": "Unknown",
    "enhanced_overview": "Leoni AG is a major industrial company headquartered in Germany, with expertise in Unknown. The company operates with 0 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Unknown, Leoni AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "84b5ed73-708c-4299-a6af-26b9f6829d42",
    "company_name": "Bechtle AG",
    "ticker": "BC8",
    "country": "Germany",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "enhanced_overview": "Bechtle AG is a leading technology company headquartered in Germany, specializing in Information Technology Services. With approximately 13,952 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Information Technology Services segment, Bechtle AG focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "84e8f996-83c3-46c7-ad09-eaf9cc873d6c",
    "company_name": "Carl Zeiss Meditec AG",
    "ticker": "AFX",
    "country": "Germany",
    "sector": "Healthcare",
    "industry": "Medical Instruments & Supplies",
    "enhanced_overview": "Carl Zeiss Meditec AG is a prominent healthcare company based in Germany, operating in the Medical Instruments & Supplies sector. The company employs 2,066 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Instruments & Supplies, Carl Zeiss Meditec AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "84f08aa2-e220-4e30-8018-70d7cdc5be42",
    "company_name": "Colas SA",
    "ticker": "RE",
    "country": "France",
    "sector": "Unknown",
    "industry": "Unknown",
    "enhanced_overview": "Colas SA is a major industrial company headquartered in France, with expertise in Unknown. The company operates with 0 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Unknown, Colas SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "868574bb-874c-4580-9c89-15bcd83fc7fc",
    "company_name": "Vonovia SE",
    "ticker": "VNA",
    "country": "Germany",
    "sector": "Real Estate",
    "industry": "Real Estate Services",
    "enhanced_overview": "Vonovia SE is a prominent real estate company headquartered in Germany, specializing in Real Estate Services. The company employs 11,189 professionals in property development, management, and investment activities.",
    "business_overview": "Active in Real Estate Services, Vonovia SE develops, owns, and manages high-quality real estate properties. The company focuses on creating value through strategic property investments and providing excellent spaces for residential, commercial, and mixed-use purposes.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "87255c36-69ed-4538-b60b-f2dc0dd9cf15",
    "company_name": "Gurit Holding AG",
    "ticker": "GURN",
    "country": "Switzerland",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "Gurit Holding AG is a major industrial company headquartered in Switzerland, with expertise in Specialty Chemicals. The company operates with 2,291 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, Gurit Holding AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "88f68b32-06f7-457d-b4a6-93826df0e968",
    "company_name": "Swiss Re AG",
    "ticker": "SREN",
    "country": "Switzerland",
    "sector": "Financial Services",
    "industry": "Insurance - Reinsurance",
    "enhanced_overview": "Swiss Re AG is a major financial services institution based in Switzerland, providing comprehensive Insurance - Reinsurance solutions. With 14,719 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Insurance - Reinsurance services, Swiss Re AG offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "8ada320e-0ba3-4849-9c4d-18e054c01054",
    "company_name": "Hera SpA",
    "ticker": "HER",
    "country": "Italy",
    "sector": "Utilities",
    "industry": "Utilities - Diversified",
    "enhanced_overview": "Hera SpA is a major utility company based in Italy, providing essential Utilities - Diversified services. With 9,965 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Diversified sector, Hera SpA manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "8b2cf838-96ea-47cf-9863-2b31bc304441",
    "company_name": "Glencore PLC",
    "ticker": "GLEN",
    "country": "Switzerland",
    "sector": "Basic Materials",
    "industry": "Other Industrial Metals & Mining",
    "enhanced_overview": "Glencore PLC is a major industrial company headquartered in Switzerland, with expertise in Other Industrial Metals & Mining. The company operates with 84,146 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Other Industrial Metals & Mining, Glencore PLC delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "8b4f605d-274e-4307-864a-d6fbacd343f0",
    "company_name": "Prysmian SpA",
    "ticker": "PRY",
    "country": "Italy",
    "sector": "Industrials",
    "industry": "Electrical Equipment & Parts",
    "enhanced_overview": "Prysmian SpA is a major industrial company headquartered in Italy, with expertise in Electrical Equipment & Parts. The company operates with 31,857 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Electrical Equipment & Parts, Prysmian SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "8c1ed472-dd3d-4ca5-88ba-616c0006413b",
    "company_name": "Duerr AG",
    "ticker": "DUE",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "Duerr AG is a major industrial company headquartered in Germany, with expertise in Specialty Industrial Machinery. The company operates with 19,894 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, Duerr AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "8cc86e9e-888f-40fe-81ca-67d3b854f35d",
    "company_name": "DKSH Holding AG",
    "ticker": "DKSH",
    "country": "Switzerland",
    "sector": "Industrials",
    "industry": "Consulting Services",
    "enhanced_overview": "DKSH Holding AG is a major industrial company headquartered in Switzerland, with expertise in Consulting Services. The company operates with 26,167 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Consulting Services, DKSH Holding AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "8e36e664-bf8d-451e-a714-da98369f10bb",
    "company_name": "Teleperformance SE",
    "ticker": "TEP",
    "country": "France",
    "sector": "Industrials",
    "industry": "Specialty Business Services",
    "enhanced_overview": "Teleperformance SE is a major industrial company headquartered in France, with expertise in Specialty Business Services. The company operates with 446,052 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Business Services, Teleperformance SE delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "90a7da0f-c17a-433f-997d-9d977034794c",
    "company_name": "Pirelli & C SpA",
    "ticker": "PIRC",
    "country": "Italy",
    "sector": "Consumer Cyclical",
    "industry": "Auto Parts",
    "enhanced_overview": "Pirelli & C SpA is a major industrial company headquartered in Italy, with expertise in Auto Parts. The company operates with 31,358 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto Parts, Pirelli & C SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "916c9185-fb76-4018-ae34-5abc011653cd",
    "company_name": "Snam SpA",
    "ticker": "SRG",
    "country": "Italy",
    "sector": "Utilities",
    "industry": "Utilities - Regulated Gas",
    "enhanced_overview": "Snam SpA is a major utility company based in Italy, providing essential Utilities - Regulated Gas services. With 3,847 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Regulated Gas sector, Snam SpA manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "917e1a28-9216-4285-b8c4-2607c702c2ed",
    "company_name": "Gerresheimer AG",
    "ticker": "GXI",
    "country": "Germany",
    "sector": "Healthcare",
    "industry": "Medical Instruments & Supplies",
    "enhanced_overview": "Gerresheimer AG is a prominent healthcare company based in Germany, operating in the Medical Instruments & Supplies sector. The company employs 12,012 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Instruments & Supplies, Gerresheimer AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "94557ea4-4dba-41f2-90f2-c4f8cfa1fc87",
    "company_name": "Zalando SE",
    "ticker": "ZAL",
    "country": "Germany",
    "sector": "Consumer Cyclical",
    "industry": "Internet Retail",
    "enhanced_overview": "Zalando SE is a major industrial company headquartered in Germany, with expertise in Internet Retail. The company operates with 15,309 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Internet Retail, Zalando SE delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "947a4af9-7e3e-4aa0-9eab-924909cd901f",
    "company_name": "Merck KGaA",
    "ticker": "MRK",
    "country": "Germany",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "enhanced_overview": "Merck KGaA is a prominent healthcare company based in Germany, operating in the Drug Manufacturers - Specialty & Generic sector. The company employs 59,020 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Drug Manufacturers - Specialty & Generic, Merck KGaA develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "96813eeb-08c3-4cb5-86d6-1c25c9456983",
    "company_name": "Landis+Gyr Group AG",
    "ticker": "LAND",
    "country": "Switzerland",
    "sector": "Industrials",
    "industry": "Electrical Equipment & Parts",
    "enhanced_overview": "Landis+Gyr Group AG is a major industrial company headquartered in Switzerland, with expertise in Electrical Equipment & Parts. The company operates with 6,700 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Electrical Equipment & Parts, Landis+Gyr Group AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "96c88982-aa41-4188-8843-58fc04454168",
    "company_name": "Beiersdorf AG",
    "ticker": "BEI",
    "country": "Germany",
    "sector": "Consumer Defensive",
    "industry": "Household & Personal Products",
    "enhanced_overview": "Beiersdorf AG is a major industrial company headquartered in Germany, with expertise in Household & Personal Products. The company operates with 22,791 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Household & Personal Products, Beiersdorf AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "9706f93f-8050-40b5-8b4f-5824fc9788aa",
    "company_name": "EnBW Energie Baden Wuerttemberg AG",
    "ticker": "EBK",
    "country": "Germany",
    "sector": "Utilities",
    "industry": "Utilities - Diversified",
    "enhanced_overview": "EnBW Energie Baden Wuerttemberg AG is a major utility company based in Germany, providing essential Utilities - Diversified services. With 27,696 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Diversified sector, EnBW Energie Baden Wuerttemberg AG manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "97df73bc-691a-47a5-adbe-292e35d1a139",
    "company_name": "Millicom International Cellular SA",
    "ticker": "TIGO",
    "country": "Luxembourg",
    "sector": "Communication Services",
    "industry": "Telecom Services",
    "enhanced_overview": "Millicom International Cellular SA is a major telecommunications and media company headquartered in Luxembourg, operating in Telecom Services. The company employs 14,000 professionals to deliver communication services and content to millions of customers.",
    "business_overview": "Specializing in Telecom Services, Millicom International Cellular SA provides essential communication infrastructure, services, and content. The company invests in advanced technologies to enhance connectivity and deliver superior customer experiences across its service areas.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "9843a48a-1896-4c83-ba88-47ecc89380f1",
    "company_name": "Evonik Industries AG",
    "ticker": "EVK",
    "country": "Germany",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "Evonik Industries AG is a major industrial company headquartered in Germany, with expertise in Specialty Chemicals. The company operates with 30,669 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, Evonik Industries AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "98f7210f-5a24-42f7-a8c2-0bfa67caeef5",
    "company_name": "Vinci SA",
    "ticker": "DG",
    "country": "France",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "enhanced_overview": "Vinci SA is a major industrial company headquartered in France, with expertise in Engineering & Construction. The company operates with 282,481 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Engineering & Construction, Vinci SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "98f7c81a-6c4e-4157-b2c9-928ee40e7b5d",
    "company_name": "Iren SpA",
    "ticker": "IRE",
    "country": "Italy",
    "sector": "Utilities",
    "industry": "Utilities - Diversified",
    "enhanced_overview": "Iren SpA is a major utility company based in Italy, providing essential Utilities - Diversified services. With 11,000 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Diversified sector, Iren SpA manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "99b68da4-7602-4d70-acd7-b6c17e190797",
    "company_name": "Swiss Steel Holding AG",
    "ticker": "STLN",
    "country": "Switzerland",
    "sector": "Basic Materials",
    "industry": "Steel",
    "enhanced_overview": "Swiss Steel Holding AG is a major industrial company headquartered in Switzerland, with expertise in Steel. The company operates with 7,565 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Steel, Swiss Steel Holding AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "99cbf089-a518-4031-bfa8-11264109120b",
    "company_name": "Interpump Group SpA",
    "ticker": "IP",
    "country": "Italy",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "Interpump Group SpA is a major industrial company headquartered in Italy, with expertise in Specialty Industrial Machinery. The company operates with 9,310 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, Interpump Group SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "99ed3a95-41c6-4ebf-b172-a011bf373507",
    "company_name": "Lenzing AG",
    "ticker": "LNZ",
    "country": "Austria",
    "sector": "Consumer Cyclical",
    "industry": "Textile Manufacturing",
    "enhanced_overview": "Lenzing AG is a major industrial company headquartered in Austria, with expertise in Textile Manufacturing. The company operates with 7,690 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Textile Manufacturing, Lenzing AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "9a0059bb-b486-4ab6-be92-87fb6edb73f0",
    "company_name": "Hermes International SCA",
    "ticker": "RMS",
    "country": "France",
    "sector": "Consumer Cyclical",
    "industry": "Luxury Goods",
    "enhanced_overview": "Hermes International SCA is a major industrial company headquartered in France, with expertise in Luxury Goods. The company operates with 25,185 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Luxury Goods, Hermes International SCA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "9a4a82c4-30b4-48fc-867f-0f228ed68b73",
    "company_name": "Biesse SpA",
    "ticker": "BSS",
    "country": "Italy",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "Biesse SpA is a major industrial company headquartered in Italy, with expertise in Specialty Industrial Machinery. The company operates with 4,131 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, Biesse SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.360Z"
  },
  {
    "company_id": "9a8eee0f-5fa5-4647-a57e-aca850d9651a",
    "company_name": "Solvay SA",
    "ticker": "SOLB",
    "country": "Belgium",
    "sector": "Basic Materials",
    "industry": "Chemicals",
    "enhanced_overview": "Solvay SA is a major industrial company headquartered in Belgium, with expertise in Chemicals. The company operates with 9,000 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Chemicals, Solvay SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.364Z"
  },
  {
    "company_id": "9d42d587-0bef-453f-83c5-035f304c93ac",
    "company_name": "Muenchener Rueckversicherungs-Gesellschaft in Muenchen AG",
    "ticker": "MUV2",
    "country": "Germany",
    "sector": "Financial Services",
    "industry": "Insurance - Reinsurance",
    "enhanced_overview": "Muenchener Rueckversicherungs-Gesellschaft in Muenchen AG is a major financial services institution based in Germany, providing comprehensive Insurance - Reinsurance solutions. With 43,584 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Insurance - Reinsurance services, Muenchener Rueckversicherungs-Gesellschaft in Muenchen AG offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.364Z"
  },
  {
    "company_id": "9e7469ca-09d2-484b-a095-ea2c232a02a5",
    "company_name": "D'Ieteren Group SA",
    "ticker": "DIE",
    "country": "Belgium",
    "sector": "Consumer Cyclical",
    "industry": "Auto & Truck Dealerships",
    "enhanced_overview": "D'Ieteren Group SA is a major industrial company headquartered in Belgium, with expertise in Auto & Truck Dealerships. The company operates with 2,468 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto & Truck Dealerships, D'Ieteren Group SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.364Z"
  },
  {
    "company_id": "9eb600ec-6b0a-4d50-939d-ba1e718649d6",
    "company_name": "Siemens Energy AG",
    "ticker": "ENR",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "Siemens Energy AG is a major industrial company headquartered in Germany, with expertise in Specialty Industrial Machinery. The company operates with 100,000 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, Siemens Energy AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.364Z"
  },
  {
    "company_id": "9f6ed156-6ddc-4130-82c6-74a61ba703d0",
    "company_name": "Umicore SA",
    "ticker": "UMI",
    "country": "Belgium",
    "sector": "Industrials",
    "industry": "Waste Management",
    "enhanced_overview": "Umicore SA is a major industrial company headquartered in Belgium, with expertise in Waste Management. The company operates with 11,251 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Waste Management, Umicore SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "9f95231c-9ddc-46a6-beb2-6c9b6c232794",
    "company_name": "Bouygues SA",
    "ticker": "EN",
    "country": "France",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "enhanced_overview": "Bouygues SA is a major industrial company headquartered in France, with expertise in Engineering & Construction. The company operates with 200,862 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Engineering & Construction, Bouygues SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "a006117b-a394-49e9-8605-f776c44c5cbc",
    "company_name": "Globant SA",
    "ticker": "GLOB",
    "country": "Luxembourg",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "enhanced_overview": "Globant SA is a leading technology company headquartered in Luxembourg, specializing in Information Technology Services. With approximately 31,280 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Information Technology Services segment, Globant SA focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "a1072f04-f8a0-4172-b5ce-bb1e1505d112",
    "company_name": "Societe Fonciere Lyonnaise SA",
    "ticker": "FLY",
    "country": "France",
    "sector": "Real Estate",
    "industry": "REIT - Office",
    "enhanced_overview": "Societe Fonciere Lyonnaise SA is a prominent real estate company headquartered in France, specializing in REIT - Office. The company employs 64 professionals in property development, management, and investment activities.",
    "business_overview": "Active in REIT - Office, Societe Fonciere Lyonnaise SA develops, owns, and manages high-quality real estate properties. The company focuses on creating value through strategic property investments and providing excellent spaces for residential, commercial, and mixed-use purposes.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "a1cbe83e-6868-40b7-9d57-57afe635b768",
    "company_name": "FDJ United",
    "ticker": "FDJU",
    "country": "France",
    "sector": "Consumer Cyclical",
    "industry": "Gambling",
    "enhanced_overview": "FDJ United is a major industrial company headquartered in France, with expertise in Gambling. The company operates with 0 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Gambling, FDJ United delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "a394f6c0-b102-4cec-88a7-ce991b6f4211",
    "company_name": "Ucb SA",
    "ticker": "UCB",
    "country": "Belgium",
    "sector": "Healthcare",
    "industry": "Biotechnology",
    "enhanced_overview": "Ucb SA is a prominent healthcare company based in Belgium, operating in the Biotechnology sector. The company employs 9,052 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Biotechnology, Ucb SA develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "a47075ab-447e-45bb-a193-348d5e5508c3",
    "company_name": "Elia Group SA",
    "ticker": "ELI",
    "country": "Belgium",
    "sector": "Utilities",
    "industry": "Utilities - Regulated Electric",
    "enhanced_overview": "Elia Group SA is a major utility company based in Belgium, providing essential Utilities - Regulated Electric services. With 3,677 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Regulated Electric sector, Elia Group SA manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "a563ec0d-2745-4368-9bf3-b375b8c411e5",
    "company_name": "Holcim AG",
    "ticker": "HOLN",
    "country": "Switzerland",
    "sector": "Basic Materials",
    "industry": "Building Materials",
    "enhanced_overview": "Holcim AG is a major industrial company headquartered in Switzerland, with expertise in Building Materials. The company operates with 62,391 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Building Materials, Holcim AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "a6387b8a-6023-417d-b929-8ab9cdfe0d01",
    "company_name": "Swiss Life Holding AG",
    "ticker": "SLHN",
    "country": "Switzerland",
    "sector": "Financial Services",
    "industry": "Insurance - Diversified",
    "enhanced_overview": "Swiss Life Holding AG is a major financial services institution based in Switzerland, providing comprehensive Insurance - Diversified solutions. With 9,134 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Insurance - Diversified services, Swiss Life Holding AG offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "a9999510-7f92-4753-9913-8ad5c23532b5",
    "company_name": "Intesa Sanpaolo SpA",
    "ticker": "ISP",
    "country": "Italy",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Intesa Sanpaolo SpA is a major financial services institution based in Italy, providing comprehensive Banks - Regional solutions. With 94,440 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Intesa Sanpaolo SpA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "ad0bd5c9-6c0d-4ae6-bd76-d98bf585c7ec",
    "company_name": "Nexi SpA",
    "ticker": "NEXI",
    "country": "Italy",
    "sector": "Technology",
    "industry": "Software - Infrastructure",
    "enhanced_overview": "Nexi SpA is a leading technology company headquartered in Italy, specializing in Software - Infrastructure. With approximately 9,526 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Software - Infrastructure segment, Nexi SpA focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "ae24f019-198b-4f13-8bb1-ead7784e2b10",
    "company_name": "Clariant AG",
    "ticker": "CLN",
    "country": "Switzerland",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "Clariant AG is a major industrial company headquartered in Switzerland, with expertise in Specialty Chemicals. The company operates with 10,465 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, Clariant AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "ae59c0d0-acdd-4355-8f93-d199e5c3e72d",
    "company_name": "Remy Cointreau SA",
    "ticker": "RCO",
    "country": "France",
    "sector": "Consumer Defensive",
    "industry": "Beverages - Wineries & Distilleries",
    "enhanced_overview": "Remy Cointreau SA is a major industrial company headquartered in France, with expertise in Beverages - Wineries & Distilleries. The company operates with 1,943 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Beverages - Wineries & Distilleries, Remy Cointreau SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "af3de7db-466c-484d-9f21-429327c2c7db",
    "company_name": "Alten SA",
    "ticker": "ATE",
    "country": "France",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "enhanced_overview": "Alten SA is a leading technology company headquartered in France, specializing in Information Technology Services. With approximately 58,300 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Information Technology Services segment, Alten SA focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "af82320a-3530-479b-919f-1775cc40200f",
    "company_name": "TotalEnergies SE",
    "ticker": "TTE",
    "country": "France",
    "sector": "Energy",
    "industry": "Oil & Gas Integrated",
    "enhanced_overview": "TotalEnergies SE is a significant energy company headquartered in France, focused on Oil & Gas Integrated. The company employs 102,579 professionals dedicated to providing reliable energy solutions and driving the transition to sustainable energy systems.",
    "business_overview": "Operating in the Oil & Gas Integrated sector, TotalEnergies SE develops, produces, and distributes energy solutions to meet growing global demand. The company invests in both traditional and renewable energy technologies to ensure energy security and environmental responsibility.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "b0937701-0c89-47dc-aa63-04273f342a9f",
    "company_name": "Italgas SpA",
    "ticker": "IG",
    "country": "Italy",
    "sector": "Utilities",
    "industry": "Utilities - Regulated Gas",
    "enhanced_overview": "Italgas SpA is a major utility company based in Italy, providing essential Utilities - Regulated Gas services. With 4,295 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Regulated Gas sector, Italgas SpA manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "b1639a77-8138-4a1e-b414-d68a27ac5044",
    "company_name": "Warehouses de Pauw NV",
    "ticker": "WDP",
    "country": "Belgium",
    "sector": "Real Estate",
    "industry": "REIT - Industrial",
    "enhanced_overview": "Warehouses de Pauw NV is a prominent real estate company headquartered in Belgium, specializing in REIT - Industrial. The company employs 123 professionals in property development, management, and investment activities.",
    "business_overview": "Active in REIT - Industrial, Warehouses de Pauw NV develops, owns, and manages high-quality real estate properties. The company focuses on creating value through strategic property investments and providing excellent spaces for residential, commercial, and mixed-use purposes.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "b2b5da7b-a966-474f-9960-3182f12aa5b7",
    "company_name": "Robert Bosch GmbH",
    "ticker": "N/A",
    "country": "Germany",
    "sector": "Unknown",
    "industry": "Unknown",
    "enhanced_overview": "Robert Bosch GmbH is a major industrial company headquartered in Germany, with expertise in Unknown. The company operates with 0 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Unknown, Robert Bosch GmbH delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "b3174d58-c2cb-453c-9555-078819cdfbb7",
    "company_name": "BKW AG",
    "ticker": "BKW",
    "country": "Switzerland",
    "sector": "Utilities",
    "industry": "Utilities - Renewable",
    "enhanced_overview": "BKW AG is a major utility company based in Switzerland, providing essential Utilities - Renewable services. With 12,139 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Renewable sector, BKW AG manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "b604cf4e-2f93-484d-bf6b-2a91a83b62fa",
    "company_name": "Banca Monte dei Paschi di Siena SpA",
    "ticker": "BMPS",
    "country": "Italy",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Banca Monte dei Paschi di Siena SpA is a major financial services institution based in Italy, providing comprehensive Banks - Regional solutions. With 16,727 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Banca Monte dei Paschi di Siena SpA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "b66aa745-87c5-4dc2-ba7b-b7ae203a3ca2",
    "company_name": "Unibail-Rodamco-Westfield SE",
    "ticker": "URW",
    "country": "France",
    "sector": "Real Estate",
    "industry": "REIT - Retail",
    "enhanced_overview": "Unibail-Rodamco-Westfield SE is a prominent real estate company headquartered in France, specializing in REIT - Retail. The company employs 2,316 professionals in property development, management, and investment activities.",
    "business_overview": "Active in REIT - Retail, Unibail-Rodamco-Westfield SE develops, owns, and manages high-quality real estate properties. The company focuses on creating value through strategic property investments and providing excellent spaces for residential, commercial, and mixed-use purposes.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "b7c2b921-eecb-4400-ac18-b0a58eb84810",
    "company_name": "Rai Way SpA",
    "ticker": "RWAY",
    "country": "Italy",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "enhanced_overview": "Rai Way SpA is a major industrial company headquartered in Italy, with expertise in Engineering & Construction. The company operates with 600 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Engineering & Construction, Rai Way SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "b7cbc668-7dd2-475c-83f1-44133301abf0",
    "company_name": "Covivio Hotels SCA",
    "ticker": "COVH",
    "country": "France",
    "sector": "Real Estate",
    "industry": "REIT - Hotel & Motel",
    "enhanced_overview": "Covivio Hotels SCA is a prominent real estate company headquartered in France, specializing in REIT - Hotel & Motel. The company employs 23 professionals in property development, management, and investment activities.",
    "business_overview": "Active in REIT - Hotel & Motel, Covivio Hotels SCA develops, owns, and manages high-quality real estate properties. The company focuses on creating value through strategic property investments and providing excellent spaces for residential, commercial, and mixed-use purposes.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "b85b8029-b9c9-47c3-9b91-15c3f88c245d",
    "company_name": "Krones AG",
    "ticker": "KRN",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "Krones AG is a major industrial company headquartered in Germany, with expertise in Specialty Industrial Machinery. The company operates with 19,788 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, Krones AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "b860f6d8-ca80-44b6-a8a5-31894b3a4c79",
    "company_name": "Schneider Electric SE",
    "ticker": "SU",
    "country": "France",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "Schneider Electric SE is a major industrial company headquartered in France, with expertise in Specialty Industrial Machinery. The company operates with 155,822 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, Schneider Electric SE delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "bad58fdd-64d4-4698-aced-43b9dbc9f3c4",
    "company_name": "Allianz SE",
    "ticker": "ALV",
    "country": "Germany",
    "sector": "Financial Services",
    "industry": "Insurance - Diversified",
    "enhanced_overview": "Allianz SE is a major financial services institution based in Germany, providing comprehensive Insurance - Diversified solutions. With 157,883 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Insurance - Diversified services, Allianz SE offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "bb2bd9ac-3cfa-45de-8a3a-1ede92b83744",
    "company_name": "Technoprobe SpA",
    "ticker": "TPRO",
    "country": "Italy",
    "sector": "Technology",
    "industry": "Semiconductors",
    "enhanced_overview": "Technoprobe SpA is a leading technology company headquartered in Italy, specializing in Semiconductors. With approximately 2,746 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Semiconductors segment, Technoprobe SpA focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "bc864345-890b-44b8-82cb-eadcca6116cb",
    "company_name": "Dassault Aviation SA",
    "ticker": "AM",
    "country": "France",
    "sector": "Industrials",
    "industry": "Aerospace & Defense",
    "enhanced_overview": "Dassault Aviation SA is a major industrial company headquartered in France, with expertise in Aerospace & Defense. The company operates with 14,589 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Aerospace & Defense, Dassault Aviation SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "bcb4b549-29b0-431d-ab3f-fdecd04c29a8",
    "company_name": "Samsonite Group SA",
    "ticker": "1910",
    "country": "Luxembourg",
    "sector": "Consumer Cyclical",
    "industry": "Footwear & Accessories",
    "enhanced_overview": "Samsonite Group SA is a major industrial company headquartered in Luxembourg, with expertise in Footwear & Accessories. The company operates with 12,100 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Footwear & Accessories, Samsonite Group SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "bd0f593b-111d-4f6c-9f89-fdaedd2dd80f",
    "company_name": "Fresenius Medical Care AG",
    "ticker": "FME",
    "country": "Germany",
    "sector": "Healthcare",
    "industry": "Medical Care Facilities",
    "enhanced_overview": "Fresenius Medical Care AG is a prominent healthcare company based in Germany, operating in the Medical Care Facilities sector. The company employs 111,513 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Care Facilities, Fresenius Medical Care AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "bd23dfb2-a6d5-4e0f-81c0-38791a1ead8f",
    "company_name": "Mayr-Melnhof Karton AG",
    "ticker": "MMK",
    "country": "Austria",
    "sector": "Consumer Cyclical",
    "industry": "Packaging & Containers",
    "enhanced_overview": "Mayr-Melnhof Karton AG is a major industrial company headquartered in Austria, with expertise in Packaging & Containers. The company operates with 14,865 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Packaging & Containers, Mayr-Melnhof Karton AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "be1625c8-d3ad-4f56-9be9-e4e6dc65dbf0",
    "company_name": "DO & CO AG",
    "ticker": "DOC",
    "country": "Austria",
    "sector": "Industrials",
    "industry": "Airports & Air Services",
    "enhanced_overview": "DO & CO AG is a major industrial company headquartered in Austria, with expertise in Airports & Air Services. The company operates with 15,538 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Airports & Air Services, DO & CO AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "be22b1aa-c594-4158-b2c2-63f9119bdaf8",
    "company_name": "Sandoz Group AG",
    "ticker": "SDZ",
    "country": "Switzerland",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "enhanced_overview": "Sandoz Group AG is a prominent healthcare company based in Switzerland, operating in the Drug Manufacturers - Specialty & Generic sector. The company employs 22,049 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Drug Manufacturers - Specialty & Generic, Sandoz Group AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "be92c798-d263-4f45-a740-a026671b7a68",
    "company_name": "Siegfried Holding AG",
    "ticker": "SFZN",
    "country": "Switzerland",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "enhanced_overview": "Siegfried Holding AG is a prominent healthcare company based in Switzerland, operating in the Drug Manufacturers - Specialty & Generic sector. The company employs 3,886 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Drug Manufacturers - Specialty & Generic, Siegfried Holding AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "bf3a5461-01c7-4167-b30c-52a9835406f5",
    "company_name": "Adidas AG",
    "ticker": "ADS",
    "country": "Germany",
    "sector": "Consumer Cyclical",
    "industry": "Footwear & Accessories",
    "enhanced_overview": "Adidas AG is a major industrial company headquartered in Germany, with expertise in Footwear & Accessories. The company operates with 46,045 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Footwear & Accessories, Adidas AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "bff44278-35df-40ec-ada2-997b964abc79",
    "company_name": "Alcon AG",
    "ticker": "ALC",
    "country": "Switzerland",
    "sector": "Healthcare",
    "industry": "Medical Instruments & Supplies",
    "enhanced_overview": "Alcon AG is a prominent healthcare company based in Switzerland, operating in the Medical Instruments & Supplies sector. The company employs 25,599 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Instruments & Supplies, Alcon AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "c038e45a-4b65-4582-ba1e-2f895bd5cd2a",
    "company_name": "Uniper SE",
    "ticker": "UN0",
    "country": "Germany",
    "sector": "Utilities",
    "industry": "Utilities - Independent Power Producers",
    "enhanced_overview": "Uniper SE is a major utility company based in Germany, providing essential Utilities - Independent Power Producers services. With 6,844 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Independent Power Producers sector, Uniper SE manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "c1032bf1-8baa-40fa-80d6-daa1ba75b841",
    "company_name": "Sonova Holding AG",
    "ticker": "SOON",
    "country": "Switzerland",
    "sector": "Healthcare",
    "industry": "Medical Devices",
    "enhanced_overview": "Sonova Holding AG is a prominent healthcare company based in Switzerland, operating in the Medical Devices sector. The company employs 18,554 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Devices, Sonova Holding AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "c11422bf-d455-462c-9913-1b7c6ddb720b",
    "company_name": "Fraport Frankfurt Airport Services Worldwide AG",
    "ticker": "FRA",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Airports & Air Services",
    "enhanced_overview": "Fraport Frankfurt Airport Services Worldwide AG is a major industrial company headquartered in Germany, with expertise in Airports & Air Services. The company operates with 19,211 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Airports & Air Services, Fraport Frankfurt Airport Services Worldwide AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "c12f87ee-1fac-4ee0-b06c-d40604dc6cee",
    "company_name": "Inficon Holding AG",
    "ticker": "IFCN",
    "country": "Switzerland",
    "sector": "Technology",
    "industry": "Scientific & Technical Instruments",
    "enhanced_overview": "Inficon Holding AG is a leading technology company headquartered in Switzerland, specializing in Scientific & Technical Instruments. With approximately 1,685 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Scientific & Technical Instruments segment, Inficon Holding AG focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "c1969a99-5dfd-4ba8-bc92-171a148967b9",
    "company_name": "SGS SA",
    "ticker": "SGSN",
    "country": "Switzerland",
    "sector": "Industrials",
    "industry": "Consulting Services",
    "enhanced_overview": "SGS SA is a major industrial company headquartered in Switzerland, with expertise in Consulting Services. The company operates with 95,244 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Consulting Services, SGS SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "c3be2903-8ede-496e-9b2c-6b4f8d0ffb49",
    "company_name": "Hochtief AG",
    "ticker": "HOT",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "enhanced_overview": "Hochtief AG is a major industrial company headquartered in Germany, with expertise in Engineering & Construction. The company operates with 50,961 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Engineering & Construction, Hochtief AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "c3e2a8c8-a6f3-464d-bb36-2719bc7bfd5e",
    "company_name": "Technip Energies NV",
    "ticker": "TE",
    "country": "France",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "enhanced_overview": "Technip Energies NV is a significant energy company headquartered in France, focused on Oil & Gas Equipment & Services. The company employs 15,105 professionals dedicated to providing reliable energy solutions and driving the transition to sustainable energy systems.",
    "business_overview": "Operating in the Oil & Gas Equipment & Services sector, Technip Energies NV develops, produces, and distributes energy solutions to meet growing global demand. The company invests in both traditional and renewable energy technologies to ensure energy security and environmental responsibility.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "c859be88-58dd-469f-9296-cde738e7cde6",
    "company_name": "Galderma Group AG",
    "ticker": "GALD",
    "country": "Switzerland",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "enhanced_overview": "Galderma Group AG is a prominent healthcare company based in Switzerland, operating in the Drug Manufacturers - Specialty & Generic sector. The company employs 6,545 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Drug Manufacturers - Specialty & Generic, Galderma Group AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "c9aa8f64-a415-41c7-94d3-784b4fb49f5b",
    "company_name": "MTU Aero Engines AG",
    "ticker": "MTX",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Aerospace & Defense",
    "enhanced_overview": "MTU Aero Engines AG is a major industrial company headquartered in Germany, with expertise in Aerospace & Defense. The company operates with 12,170 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Aerospace & Defense, MTU Aero Engines AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "ca95e5d1-7674-44de-a225-b2440d1602f8",
    "company_name": "Belimo Holding AG",
    "ticker": "BEAN",
    "country": "Switzerland",
    "sector": "Industrials",
    "industry": "Building Products & Equipment",
    "enhanced_overview": "Belimo Holding AG is a major industrial company headquartered in Switzerland, with expertise in Building Products & Equipment. The company operates with 2,071 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Building Products & Equipment, Belimo Holding AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "cb406400-5415-4cd7-973c-1827cdca02ec",
    "company_name": "Baloise Holding AG",
    "ticker": "BALN",
    "country": "Switzerland",
    "sector": "Financial Services",
    "industry": "Insurance - Diversified",
    "enhanced_overview": "Baloise Holding AG is a major financial services institution based in Switzerland, providing comprehensive Insurance - Diversified solutions. With 0 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Insurance - Diversified services, Baloise Holding AG offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "cb975665-3484-48f6-bc27-ad87defbce56",
    "company_name": "Zuger Kantonalbank",
    "ticker": "ZUGER",
    "country": "Switzerland",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Zuger Kantonalbank is a major financial services institution based in Switzerland, providing comprehensive Banks - Regional solutions. With 498 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Zuger Kantonalbank offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.365Z"
  },
  {
    "company_id": "cc329952-b7f6-40c7-bd42-8cc4a24f612d",
    "company_name": "Siltronic AG",
    "ticker": "WAF",
    "country": "Germany",
    "sector": "Technology",
    "industry": "Semiconductors",
    "enhanced_overview": "Siltronic AG is a leading technology company headquartered in Germany, specializing in Semiconductors. With approximately 3,825 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Semiconductors segment, Siltronic AG focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "cc98ade3-5448-4963-9bb8-fa4f6b875032",
    "company_name": "De' Longhi SpA",
    "ticker": "DLG",
    "country": "Italy",
    "sector": "Consumer Cyclical",
    "industry": "Furnishings, Fixtures & Appliances",
    "enhanced_overview": "De' Longhi SpA is a major industrial company headquartered in Italy, with expertise in Furnishings, Fixtures & Appliances. The company operates with 9,434 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Furnishings, Fixtures & Appliances, De' Longhi SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "cd32764b-ffa9-455b-bdde-cf97bb470e4b",
    "company_name": "Spie SA",
    "ticker": "SPIE",
    "country": "France",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "enhanced_overview": "Spie SA is a major industrial company headquartered in France, with expertise in Engineering & Construction. The company operates with 52,787 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Engineering & Construction, Spie SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "ce82c729-faae-46da-a0bb-b57983b39aaf",
    "company_name": "Flughafen Wien AG",
    "ticker": "FLU",
    "country": "Austria",
    "sector": "Industrials",
    "industry": "Airports & Air Services",
    "enhanced_overview": "Flughafen Wien AG is a major industrial company headquartered in Austria, with expertise in Airports & Air Services. The company operates with 5,478 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Airports & Air Services, Flughafen Wien AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "ceb6e7cb-097c-4ffd-b461-d29eed6fe4e1",
    "company_name": "Scor SE",
    "ticker": "SCR",
    "country": "France",
    "sector": "Financial Services",
    "industry": "Insurance - Reinsurance",
    "enhanced_overview": "Scor SE is a major financial services institution based in France, providing comprehensive Insurance - Reinsurance solutions. With 3,491 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Insurance - Reinsurance services, Scor SE offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "cebc77f9-d944-4e95-be7c-1f2f78be64ee",
    "company_name": "Aeroports de Paris SA",
    "ticker": "ADP",
    "country": "France",
    "sector": "Industrials",
    "industry": "Airports & Air Services",
    "enhanced_overview": "Aeroports de Paris SA is a major industrial company headquartered in France, with expertise in Airports & Air Services. The company operates with 28,174 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Airports & Air Services, Aeroports de Paris SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "d014acbe-0e65-46ae-999c-852c3d145236",
    "company_name": "Mediobanca Banca di Credito Finanziario SpA",
    "ticker": "MB",
    "country": "Italy",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Mediobanca Banca di Credito Finanziario SpA is a major financial services institution based in Italy, providing comprehensive Banks - Regional solutions. With 5,510 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Mediobanca Banca di Credito Finanziario SpA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "d0c07c89-bf25-43d4-a6db-257be5018f12",
    "company_name": "Unifiedpost Group SA",
    "ticker": "UPG",
    "country": "Belgium",
    "sector": "Technology",
    "industry": "Software - Application",
    "enhanced_overview": "Unifiedpost Group SA is a leading technology company headquartered in Belgium, specializing in Software - Application. With approximately 1,042 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Software - Application segment, Unifiedpost Group SA focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "d0eec049-5f0c-4bfb-819e-28bce6d93fa7",
    "company_name": "Garmin Ltd",
    "ticker": "GRMN",
    "country": "Switzerland",
    "sector": "Technology",
    "industry": "Scientific & Technical Instruments",
    "enhanced_overview": "Garmin Ltd is a leading technology company headquartered in Switzerland, specializing in Scientific & Technical Instruments. With approximately 21,800 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Scientific & Technical Instruments segment, Garmin Ltd focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "d21ce417-5864-4fc8-aaf8-b91a6fb19660",
    "company_name": "Swissquote Group Holding SA",
    "ticker": "SQN",
    "country": "Switzerland",
    "sector": "Financial Services",
    "industry": "Capital Markets",
    "enhanced_overview": "Swissquote Group Holding SA is a major financial services institution based in Switzerland, providing comprehensive Capital Markets solutions. With 954 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Capital Markets services, Swissquote Group Holding SA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "d2e1f545-59b7-413f-b721-69c08cfba3e4",
    "company_name": "Jungheinrich AG",
    "ticker": "Jun.03",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "Jungheinrich AG is a major industrial company headquartered in Germany, with expertise in Specialty Industrial Machinery. The company operates with 20,841 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, Jungheinrich AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "d4bc5690-b568-4241-be5d-138930f94951",
    "company_name": "Covestro AG",
    "ticker": "1COV",
    "country": "Germany",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "Covestro AG is a major industrial company headquartered in Germany, with expertise in Specialty Chemicals. The company operates with 17,503 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, Covestro AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "d4c35e2f-22fe-4a04-b473-47108cb22af4",
    "company_name": "L'Oreal SA",
    "ticker": "OR",
    "country": "France",
    "sector": "Consumer Defensive",
    "industry": "Household & Personal Products",
    "enhanced_overview": "L'Oreal SA is a major industrial company headquartered in France, with expertise in Household & Personal Products. The company operates with 94,397 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Household & Personal Products, L'Oreal SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "d4c606b3-cfd7-4319-bc8b-948a11635575",
    "company_name": "Coca Cola HBC AG",
    "ticker": "CCH",
    "country": "Switzerland",
    "sector": "Consumer Defensive",
    "industry": "Beverages - Non-Alcoholic",
    "enhanced_overview": "Coca Cola HBC AG is a major industrial company headquartered in Switzerland, with expertise in Beverages - Non-Alcoholic. The company operates with 33,000 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Beverages - Non-Alcoholic, Coca Cola HBC AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "d5c2c897-d309-49ac-81d6-776bd723094e",
    "company_name": "Eiffage SA",
    "ticker": "FGR",
    "country": "France",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "enhanced_overview": "Eiffage SA is a major industrial company headquartered in France, with expertise in Engineering & Construction. The company operates with 78,200 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Engineering & Construction, Eiffage SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "d70b1d0e-7d4b-41ad-a19f-925314428bfa",
    "company_name": "Ypsomed Holding AG",
    "ticker": "YPSN",
    "country": "Switzerland",
    "sector": "Healthcare",
    "industry": "Medical Instruments & Supplies",
    "enhanced_overview": "Ypsomed Holding AG is a prominent healthcare company based in Switzerland, operating in the Medical Instruments & Supplies sector. The company employs 2,600 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Instruments & Supplies, Ypsomed Holding AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "d9066e9c-2b14-441a-979e-a7cdd7539000",
    "company_name": "Eramet SA",
    "ticker": "ERA",
    "country": "France",
    "sector": "Basic Materials",
    "industry": "Other Industrial Metals & Mining",
    "enhanced_overview": "Eramet SA is a major industrial company headquartered in France, with expertise in Other Industrial Metals & Mining. The company operates with 8,828 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Other Industrial Metals & Mining, Eramet SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "d92af7a5-a78c-4803-9193-dee6f36e1d67",
    "company_name": "Compagnie Generale des Etablissements Michelin SCA",
    "ticker": "ML",
    "country": "France",
    "sector": "Unknown",
    "industry": "Unknown",
    "enhanced_overview": "Compagnie Generale des Etablissements Michelin SCA is a major industrial company headquartered in France, with expertise in Unknown. The company operates with 0 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Unknown, Compagnie Generale des Etablissements Michelin SCA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "dae9d635-df7e-4b76-bff9-a988df462700",
    "company_name": "Stevanato Group SpA",
    "ticker": "STVN",
    "country": "Italy",
    "sector": "Healthcare",
    "industry": "Medical Instruments & Supplies",
    "enhanced_overview": "Stevanato Group SpA is a prominent healthcare company based in Italy, operating in the Medical Instruments & Supplies sector. The company employs 5,521 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Instruments & Supplies, Stevanato Group SpA develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "db8630ab-b047-4bda-aee0-e321850e2108",
    "company_name": "Temenos AG",
    "ticker": "TEMN",
    "country": "Switzerland",
    "sector": "Technology",
    "industry": "Software - Application",
    "enhanced_overview": "Temenos AG is a leading technology company headquartered in Switzerland, specializing in Software - Application. With approximately 6,212 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Software - Application segment, Temenos AG focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "dc20cc19-9767-41e7-9d14-5ea3273afbbf",
    "company_name": "Electricite De France SA",
    "ticker": "EDF",
    "country": "France",
    "sector": "Utilities",
    "industry": "Utilities - Diversified",
    "enhanced_overview": "Electricite De France SA is a major utility company based in France, providing essential Utilities - Diversified services. With 165,028 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Diversified sector, Electricite De France SA manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "dca7ba08-2d4f-4c9b-a0be-59e8dc272bde",
    "company_name": "Veolia Environnement SA",
    "ticker": "VIE",
    "country": "France",
    "sector": "Industrials",
    "industry": "Waste Management",
    "enhanced_overview": "Veolia Environnement SA is a major industrial company headquartered in France, with expertise in Waste Management. The company operates with 202,332 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Waste Management, Veolia Environnement SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "dd31ca5f-00f8-4ee5-8f03-c5aa5afe692f",
    "company_name": "L'Occitane International SA",
    "ticker": "973",
    "country": "Luxembourg",
    "sector": "Consumer Defensive",
    "industry": "Household & Personal Products",
    "enhanced_overview": "L'Occitane International SA is a major industrial company headquartered in Luxembourg, with expertise in Household & Personal Products. The company operates with 9,255 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Household & Personal Products, L'Occitane International SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "dd650098-9ad4-4ebb-8fe4-0ffc948e7714",
    "company_name": "Sanofi SA",
    "ticker": "SAN",
    "country": "France",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - General",
    "enhanced_overview": "Sanofi SA is a prominent healthcare company based in France, operating in the Drug Manufacturers - General sector. The company employs 82,878 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Drug Manufacturers - General, Sanofi SA develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "de00d3fc-5166-49b0-a44d-8dc750ab06e6",
    "company_name": "Zurich Insurance Group AG",
    "ticker": "ZURN",
    "country": "Switzerland",
    "sector": "Financial Services",
    "industry": "Insurance - Diversified",
    "enhanced_overview": "Zurich Insurance Group AG is a major financial services institution based in Switzerland, providing comprehensive Insurance - Diversified solutions. With 60,000 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Insurance - Diversified services, Zurich Insurance Group AG offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "de737b4e-593c-4785-8db8-8feb74a4bd5e",
    "company_name": "Klepierre SA",
    "ticker": "LI",
    "country": "France",
    "sector": "Real Estate",
    "industry": "REIT - Retail",
    "enhanced_overview": "Klepierre SA is a prominent real estate company headquartered in France, specializing in REIT - Retail. The company employs 1,056 professionals in property development, management, and investment activities.",
    "business_overview": "Active in REIT - Retail, Klepierre SA develops, owns, and manages high-quality real estate properties. The company focuses on creating value through strategic property investments and providing excellent spaces for residential, commercial, and mixed-use purposes.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "ded4291b-0546-4afd-b264-ee69ddecceb6",
    "company_name": "Webuild SpA",
    "ticker": "WBD",
    "country": "Italy",
    "sector": "Industrials",
    "industry": "Engineering & Construction",
    "enhanced_overview": "Webuild SpA is a major industrial company headquartered in Italy, with expertise in Engineering & Construction. The company operates with 39,666 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Engineering & Construction, Webuild SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e0abfaa7-c28e-44e6-a9b0-252a557c34b2",
    "company_name": "Infrastrutture Wireless Italiane SpA",
    "ticker": "INW",
    "country": "Italy",
    "sector": "Real Estate",
    "industry": "Real Estate Services",
    "enhanced_overview": "Infrastrutture Wireless Italiane SpA is a prominent real estate company headquartered in Italy, specializing in Real Estate Services. The company employs 321 professionals in property development, management, and investment activities.",
    "business_overview": "Active in Real Estate Services, Infrastrutture Wireless Italiane SpA develops, owns, and manages high-quality real estate properties. The company focuses on creating value through strategic property investments and providing excellent spaces for residential, commercial, and mixed-use purposes.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e0c57e18-3a06-4fd6-bd71-bbc43288ea50",
    "company_name": "Eni SpA",
    "ticker": "ENI",
    "country": "Italy",
    "sector": "Energy",
    "industry": "Oil & Gas Integrated",
    "enhanced_overview": "Eni SpA is a significant energy company headquartered in Italy, focused on Oil & Gas Integrated. The company employs 33,142 professionals dedicated to providing reliable energy solutions and driving the transition to sustainable energy systems.",
    "business_overview": "Operating in the Oil & Gas Integrated sector, Eni SpA develops, produces, and distributes energy solutions to meet growing global demand. The company invests in both traditional and renewable energy technologies to ensure energy security and environmental responsibility.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e21872ef-68f4-4399-bba2-9fdfb6ea4f78",
    "company_name": "Heidelberg Materials AG",
    "ticker": "HEI",
    "country": "Germany",
    "sector": "Basic Materials",
    "industry": "Building Materials",
    "enhanced_overview": "Heidelberg Materials AG is a major industrial company headquartered in Germany, with expertise in Building Materials. The company operates with 50,692 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Building Materials, Heidelberg Materials AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e228e31c-c73b-42c0-8121-87954c0f38cf",
    "company_name": "IONOS Group SE",
    "ticker": "IOS",
    "country": "Germany",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "enhanced_overview": "IONOS Group SE is a leading technology company headquartered in Germany, specializing in Information Technology Services. With approximately 4,092 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Information Technology Services segment, IONOS Group SE focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e2316cd3-ace2-4a68-b94d-0b8dbe647ae1",
    "company_name": "Infineon Technologies AG",
    "ticker": "IFX",
    "country": "Germany",
    "sector": "Technology",
    "industry": "Semiconductors",
    "enhanced_overview": "Infineon Technologies AG is a leading technology company headquartered in Germany, specializing in Semiconductors. With approximately 58,008 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Semiconductors segment, Infineon Technologies AG focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e275c0e2-b836-4c52-8742-54be2cb54553",
    "company_name": "Ayvens SA",
    "ticker": "AYV",
    "country": "France",
    "sector": "Industrials",
    "industry": "Rental & Leasing Services",
    "enhanced_overview": "Ayvens SA is a major industrial company headquartered in France, with expertise in Rental & Leasing Services. The company operates with 14,500 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Rental & Leasing Services, Ayvens SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e2ead517-d1b7-407b-ab57-206c2fe966db",
    "company_name": "Dassault Systemes SE",
    "ticker": "DSY",
    "country": "France",
    "sector": "Technology",
    "industry": "Software - Application",
    "enhanced_overview": "Dassault Systemes SE is a leading technology company headquartered in France, specializing in Software - Application. With approximately 24,433 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Software - Application segment, Dassault Systemes SE focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e2faf33b-5d9c-4b61-b297-129a829e15cd",
    "company_name": "Deutsche Telekom AG",
    "ticker": "DTE",
    "country": "Germany",
    "sector": "Communication Services",
    "industry": "Telecom Services",
    "enhanced_overview": "Deutsche Telekom AG is a major telecommunications and media company headquartered in Germany, operating in Telecom Services. The company employs 198,194 professionals to deliver communication services and content to millions of customers.",
    "business_overview": "Specializing in Telecom Services, Deutsche Telekom AG provides essential communication infrastructure, services, and content. The company invests in advanced technologies to enhance connectivity and deliver superior customer experiences across its service areas.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e4760b73-d6e0-4ece-8040-1af6bd23c581",
    "company_name": "Davide Campari Milano NV",
    "ticker": "CPR",
    "country": "Italy",
    "sector": "Consumer Defensive",
    "industry": "Beverages - Wineries & Distilleries",
    "enhanced_overview": "Davide Campari Milano NV is a major industrial company headquartered in Italy, with expertise in Beverages - Wineries & Distilleries. The company operates with 5,182 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Beverages - Wineries & Distilleries, Davide Campari Milano NV delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e6869b28-6dc5-49b4-8b96-444badfffe33",
    "company_name": "Novartis AG",
    "ticker": "NOVN",
    "country": "Switzerland",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - General",
    "enhanced_overview": "Novartis AG is a prominent healthcare company based in Switzerland, operating in the Drug Manufacturers - General sector. The company employs 75,883 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Drug Manufacturers - General, Novartis AG develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e6d167d7-4946-4bcc-9c13-ac8a6ff435a4",
    "company_name": "Leonardo SpA",
    "ticker": "LDO",
    "country": "Italy",
    "sector": "Industrials",
    "industry": "Aerospace & Defense",
    "enhanced_overview": "Leonardo SpA is a major industrial company headquartered in Italy, with expertise in Aerospace & Defense. The company operates with 59,083 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Aerospace & Defense, Leonardo SpA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e72431eb-3b86-4d7f-8704-1db78f41ca34",
    "company_name": "Ariston Holding NV",
    "ticker": "ARIS",
    "country": "Italy",
    "sector": "Industrials",
    "industry": "Building Products & Equipment",
    "enhanced_overview": "Ariston Holding NV is a major industrial company headquartered in Italy, with expertise in Building Products & Equipment. The company operates with 10,576 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Building Products & Equipment, Ariston Holding NV delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e727fa6f-5734-49bd-84c0-c40aa74f9100",
    "company_name": "Ternium SA",
    "ticker": "TX",
    "country": "Luxembourg",
    "sector": "Basic Materials",
    "industry": "Steel",
    "enhanced_overview": "Ternium SA is a major industrial company headquartered in Luxembourg, with expertise in Steel. The company operates with 33,949 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Steel, Ternium SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e73f5ad1-2ff9-4ac0-b2ab-ebc68dafdad6",
    "company_name": "Thales SA",
    "ticker": "HO",
    "country": "France",
    "sector": "Industrials",
    "industry": "Aerospace & Defense",
    "enhanced_overview": "Thales SA is a major industrial company headquartered in France, with expertise in Aerospace & Defense. The company operates with 83,206 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Aerospace & Defense, Thales SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e7594a72-0cc1-4be8-95ca-0fffe3b7c49f",
    "company_name": "Atos SE",
    "ticker": "ATO",
    "country": "France",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "enhanced_overview": "Atos SE is a leading technology company headquartered in France, specializing in Information Technology Services. With approximately 91,611 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Information Technology Services segment, Atos SE focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e7f328d8-73ac-4d5f-b7b9-c214bbe5be5d",
    "company_name": "Mercedes-Benz Group AG",
    "ticker": "MBG",
    "country": "Germany",
    "sector": "Consumer Cyclical",
    "industry": "Auto Manufacturers",
    "enhanced_overview": "Mercedes-Benz Group AG is a major industrial company headquartered in Germany, with expertise in Auto Manufacturers. The company operates with 163,132 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto Manufacturers, Mercedes-Benz Group AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e860bf2d-6d4b-4102-bacd-2ca6a0aa12d1",
    "company_name": "Raiffeisen Bank International AG",
    "ticker": "RBI",
    "country": "Austria",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Raiffeisen Bank International AG is a major financial services institution based in Austria, providing comprehensive Banks - Regional solutions. With 42,564 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Raiffeisen Bank International AG offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "e9f4dd24-433e-4247-ae35-070d09b90db4",
    "company_name": "Nestle SA",
    "ticker": "NESN",
    "country": "Switzerland",
    "sector": "Consumer Defensive",
    "industry": "Packaged Foods",
    "enhanced_overview": "Nestle SA is a major industrial company headquartered in Switzerland, with expertise in Packaged Foods. The company operates with 251,786 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Packaged Foods, Nestle SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "eb16eef3-a0ea-4469-a96b-d43981250088",
    "company_name": "Credit Agricole SA",
    "ticker": "ACA",
    "country": "France",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Credit Agricole SA is a major financial services institution based in France, providing comprehensive Banks - Regional solutions. With 80,518 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Credit Agricole SA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "eb83f0c2-e89c-4207-b3f5-6644c238f52f",
    "company_name": "Abb Ltd",
    "ticker": "ABBN",
    "country": "Switzerland",
    "sector": "Industrials",
    "industry": "Electrical Equipment & Parts",
    "enhanced_overview": "Abb Ltd is a major industrial company headquartered in Switzerland, with expertise in Electrical Equipment & Parts. The company operates with 109,900 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Electrical Equipment & Parts, Abb Ltd delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "ec1a1e44-1541-4d62-8b62-39fe7a93905d",
    "company_name": "Compagnie De l'odet SE",
    "ticker": "ODET",
    "country": "France",
    "sector": "Communication Services",
    "industry": "Entertainment",
    "enhanced_overview": "Compagnie De l'odet SE is a major telecommunications and media company headquartered in France, operating in Entertainment. The company employs 79,405 professionals to deliver communication services and content to millions of customers.",
    "business_overview": "Specializing in Entertainment, Compagnie De l'odet SE provides essential communication infrastructure, services, and content. The company invests in advanced technologies to enhance connectivity and deliver superior customer experiences across its service areas.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "ee5d9b6b-9493-46f2-965e-de0260118ae4",
    "company_name": "Sika AG",
    "ticker": "SIKA",
    "country": "Switzerland",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "Sika AG is a major industrial company headquartered in Switzerland, with expertise in Specialty Chemicals. The company operates with 33,511 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, Sika AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "eee3a665-b9b2-4572-8a23-9c39d799e1c5",
    "company_name": "Covivio SA",
    "ticker": "COV",
    "country": "France",
    "sector": "Real Estate",
    "industry": "REIT - Diversified",
    "enhanced_overview": "Covivio SA is a prominent real estate company headquartered in France, specializing in REIT - Diversified. The company employs 989 professionals in property development, management, and investment activities.",
    "business_overview": "Active in REIT - Diversified, Covivio SA develops, owns, and manages high-quality real estate properties. The company focuses on creating value through strategic property investments and providing excellent spaces for residential, commercial, and mixed-use purposes.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "f25259a1-9784-4a59-9eef-c06daec70926",
    "company_name": "Wacker Chemie AG",
    "ticker": "WCH",
    "country": "Germany",
    "sector": "Basic Materials",
    "industry": "Specialty Chemicals",
    "enhanced_overview": "Wacker Chemie AG is a major industrial company headquartered in Germany, with expertise in Specialty Chemicals. The company operates with 12,825 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Chemicals, Wacker Chemie AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "f3371912-7d76-477c-83e1-51fdab0cb2c9",
    "company_name": "VAT Group AG",
    "ticker": "VACN",
    "country": "Switzerland",
    "sector": "Industrials",
    "industry": "Specialty Industrial Machinery",
    "enhanced_overview": "VAT Group AG is a major industrial company headquartered in Switzerland, with expertise in Specialty Industrial Machinery. The company operates with 3,202 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Specialty Industrial Machinery, VAT Group AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.366Z"
  },
  {
    "company_id": "f4104d3e-0794-4ad6-b58b-a8d1a4e862c0",
    "company_name": "Aurubis AG",
    "ticker": "NDA",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Metal Fabrication",
    "enhanced_overview": "Aurubis AG is a major industrial company headquartered in Germany, with expertise in Metal Fabrication. The company operates with 7,011 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Metal Fabrication, Aurubis AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "f42b2471-bfc3-4245-b213-4d0b6f58b3c0",
    "company_name": "LVMH Moet Hennessy Louis Vuitton SE",
    "ticker": "MC",
    "country": "France",
    "sector": "Consumer Cyclical",
    "industry": "Luxury Goods",
    "enhanced_overview": "LVMH Moet Hennessy Louis Vuitton SE is a major industrial company headquartered in France, with expertise in Luxury Goods. The company operates with 200,518 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Luxury Goods, LVMH Moet Hennessy Louis Vuitton SE delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "f4dbe4bc-2dc1-4296-90d2-440b0a91286b",
    "company_name": "Kion Group AG",
    "ticker": "KGX",
    "country": "Germany",
    "sector": "Industrials",
    "industry": "Farm & Heavy Construction Machinery",
    "enhanced_overview": "Kion Group AG is a major industrial company headquartered in Germany, with expertise in Farm & Heavy Construction Machinery. The company operates with 42,719 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Farm & Heavy Construction Machinery, Kion Group AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "f5363197-c6d5-49ec-9478-a8b015d72538",
    "company_name": "Societe BIC SA",
    "ticker": "BB",
    "country": "France",
    "sector": "Consumer Defensive",
    "industry": "Household & Personal Products",
    "enhanced_overview": "Societe BIC SA is a major industrial company headquartered in France, with expertise in Household & Personal Products. The company operates with 13,000 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Household & Personal Products, Societe BIC SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "f54c5d5b-e241-419d-84bc-55822b4f4ae7",
    "company_name": "Ermenegildo Zegna NV",
    "ticker": "ZGN",
    "country": "Italy",
    "sector": "Consumer Cyclical",
    "industry": "Apparel Manufacturing",
    "enhanced_overview": "Ermenegildo Zegna NV is a major industrial company headquartered in Italy, with expertise in Apparel Manufacturing. The company operates with 7,100 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Apparel Manufacturing, Ermenegildo Zegna NV delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "f5edf2c6-9ccb-4eea-931f-946780e7a3de",
    "company_name": "Sopra Steria Group SA",
    "ticker": "SOP",
    "country": "France",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "enhanced_overview": "Sopra Steria Group SA is a leading technology company headquartered in France, specializing in Information Technology Services. With approximately 50,988 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Information Technology Services segment, Sopra Steria Group SA focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "f5f1e077-69e0-49a6-889d-61b52ca77c7f",
    "company_name": "FinecoBank Banca Fineco SpA",
    "ticker": "FBK",
    "country": "Italy",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "FinecoBank Banca Fineco SpA is a major financial services institution based in Italy, providing comprehensive Banks - Regional solutions. With 1,438 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, FinecoBank Banca Fineco SpA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "f66ebd77-1a9c-4a94-a6ca-b11af911d9a9",
    "company_name": "Legrand SA",
    "ticker": "LR",
    "country": "France",
    "sector": "Industrials",
    "industry": "Electrical Equipment & Parts",
    "enhanced_overview": "Legrand SA is a major industrial company headquartered in France, with expertise in Electrical Equipment & Parts. The company operates with 38,306 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Electrical Equipment & Parts, Legrand SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "f70f59d8-65a5-4e8e-9f8d-0cce25aa985f",
    "company_name": "Publicis Groupe SA",
    "ticker": "PUB",
    "country": "France",
    "sector": "Communication Services",
    "industry": "Advertising Agencies",
    "enhanced_overview": "Publicis Groupe SA is a major telecommunications and media company headquartered in France, operating in Advertising Agencies. The company employs 103,000 professionals to deliver communication services and content to millions of customers.",
    "business_overview": "Specializing in Advertising Agencies, Publicis Groupe SA provides essential communication infrastructure, services, and content. The company invests in advanced technologies to enhance connectivity and deliver superior customer experiences across its service areas.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "f716b65c-2761-4edf-8491-5d0e54e0ec1f",
    "company_name": "Sartorius Stedim Biotech SA",
    "ticker": "DIM",
    "country": "France",
    "sector": "Healthcare",
    "industry": "Medical Instruments & Supplies",
    "enhanced_overview": "Sartorius Stedim Biotech SA is a prominent healthcare company based in France, operating in the Medical Instruments & Supplies sector. The company employs 9,901 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Instruments & Supplies, Sartorius Stedim Biotech SA develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "f7f3e5e4-6640-4a74-a832-75db488dbfba",
    "company_name": "Credito Emiliano SpA",
    "ticker": "CE",
    "country": "Italy",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Credito Emiliano SpA is a major financial services institution based in Italy, providing comprehensive Banks - Regional solutions. With 6,627 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Credito Emiliano SpA offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "fa15bffb-5f42-424d-a215-e423abd5dd56",
    "company_name": "Banque Cantonale Vaudoise",
    "ticker": "BCVN",
    "country": "Switzerland",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Banque Cantonale Vaudoise is a major financial services institution based in Switzerland, providing comprehensive Banks - Regional solutions. With 2,060 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Banque Cantonale Vaudoise offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "fa3601d8-5888-4225-af72-0778d3075cad",
    "company_name": "Puma SE",
    "ticker": "PUM",
    "country": "Germany",
    "sector": "Consumer Cyclical",
    "industry": "Footwear & Accessories",
    "enhanced_overview": "Puma SE is a major industrial company headquartered in Germany, with expertise in Footwear & Accessories. The company operates with 17,303 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Footwear & Accessories, Puma SE delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "fa7d77b1-df55-4750-ad6c-098b9b56be80",
    "company_name": "Compagnie de Saint Gobain SA",
    "ticker": "SGO",
    "country": "France",
    "sector": "Industrials",
    "industry": "Building Products & Equipment",
    "enhanced_overview": "Compagnie de Saint Gobain SA is a major industrial company headquartered in France, with expertise in Building Products & Equipment. The company operates with 161,482 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Building Products & Equipment, Compagnie de Saint Gobain SA delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "faf49564-ff30-4f60-9305-8165ee208fb6",
    "company_name": "Continental AG",
    "ticker": "CON",
    "country": "Germany",
    "sector": "Consumer Cyclical",
    "industry": "Auto Parts",
    "enhanced_overview": "Continental AG is a major industrial company headquartered in Germany, with expertise in Auto Parts. The company operates with 168,761 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Auto Parts, Continental AG delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "faf760a7-38b5-4717-9038-241f0e1780ca",
    "company_name": "Stratec Se",
    "ticker": "SBS",
    "country": "Germany",
    "sector": "Healthcare",
    "industry": "Medical Devices",
    "enhanced_overview": "Stratec Se is a prominent healthcare company based in Germany, operating in the Medical Devices sector. The company employs 1,462 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Medical Devices, Stratec Se develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "fbecfb30-693d-4f4f-a12c-b7e744bbfe28",
    "company_name": "OMV AG",
    "ticker": "OMV",
    "country": "Austria",
    "sector": "Energy",
    "industry": "Oil & Gas Integrated",
    "enhanced_overview": "OMV AG is a significant energy company headquartered in Austria, focused on Oil & Gas Integrated. The company employs 23,557 professionals dedicated to providing reliable energy solutions and driving the transition to sustainable energy systems.",
    "business_overview": "Operating in the Oil & Gas Integrated sector, OMV AG develops, produces, and distributes energy solutions to meet growing global demand. The company invests in both traditional and renewable energy technologies to ensure energy security and environmental responsibility.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "fc76c8d2-fab8-4707-a2fb-f62273d7d237",
    "company_name": "Engie SA",
    "ticker": "ENGI",
    "country": "France",
    "sector": "Utilities",
    "industry": "Utilities - Diversified",
    "enhanced_overview": "Engie SA is a major utility company based in France, providing essential Utilities - Diversified services. With 97,000 employees, the company ensures reliable utility services to communities and businesses.",
    "business_overview": "Operating in the Utilities - Diversified sector, Engie SA manages critical infrastructure to deliver essential services including electricity, gas, and water. The company focuses on operational efficiency, environmental sustainability, and service reliability.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "fcfba1d8-78b8-4bc2-89c4-3f589099bc96",
    "company_name": "Saipem SpA",
    "ticker": "SPM",
    "country": "Italy",
    "sector": "Energy",
    "industry": "Oil & Gas Equipment & Services",
    "enhanced_overview": "Saipem SpA is a significant energy company headquartered in Italy, focused on Oil & Gas Equipment & Services. The company employs 30,000 professionals dedicated to providing reliable energy solutions and driving the transition to sustainable energy systems.",
    "business_overview": "Operating in the Oil & Gas Equipment & Services sector, Saipem SpA develops, produces, and distributes energy solutions to meet growing global demand. The company invests in both traditional and renewable energy technologies to ensure energy security and environmental responsibility.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "fe946363-3e7b-4828-ab97-16394f4b46b3",
    "company_name": "Reply SpA",
    "ticker": "REY",
    "country": "Italy",
    "sector": "Technology",
    "industry": "Information Technology Services",
    "enhanced_overview": "Reply SpA is a leading technology company headquartered in Italy, specializing in Information Technology Services. With approximately 15,353 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Information Technology Services segment, Reply SpA focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "fe9b37b7-ac28-4062-a36e-cf325122717a",
    "company_name": "Swisscom AG",
    "ticker": "SCMN",
    "country": "Switzerland",
    "sector": "Communication Services",
    "industry": "Telecom Services",
    "enhanced_overview": "Swisscom AG is a major telecommunications and media company headquartered in Switzerland, operating in Telecom Services. The company employs 19,887 professionals to deliver communication services and content to millions of customers.",
    "business_overview": "Specializing in Telecom Services, Swisscom AG provides essential communication infrastructure, services, and content. The company invests in advanced technologies to enhance connectivity and deliver superior customer experiences across its service areas.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "fee16446-014f-47fa-b7ca-2970114760a5",
    "company_name": "Eurofins Scientific SE",
    "ticker": "ERF",
    "country": "Luxembourg",
    "sector": "Healthcare",
    "industry": "Diagnostics & Research",
    "enhanced_overview": "Eurofins Scientific SE is a prominent healthcare company based in Luxembourg, operating in the Diagnostics & Research sector. The company employs 62,696 professionals dedicated to advancing healthcare solutions and improving patient outcomes globally.",
    "business_overview": "As a healthcare leader in Diagnostics & Research, Eurofins Scientific SE develops and provides essential medical solutions, pharmaceuticals, and healthcare services. The company's operations span multiple markets, contributing to global health and wellness initiatives.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "ff0cb5fb-e72c-4d4a-a47e-35012fd37a60",
    "company_name": "Cembra Money Bank AG",
    "ticker": "CMBN",
    "country": "Switzerland",
    "sector": "Financial Services",
    "industry": "Banks - Regional",
    "enhanced_overview": "Cembra Money Bank AG is a major financial services institution based in Switzerland, providing comprehensive Banks - Regional solutions. With 759 professionals, the company serves individual and corporate clients across multiple markets.",
    "business_overview": "As a leading provider of Banks - Regional services, Cembra Money Bank AG offers a wide range of financial products including banking, investment, and advisory services. The company maintains strong client relationships and upholds the highest standards of financial integrity.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "ffb865fa-5e72-48a8-9d71-97cbcc66ff79",
    "company_name": "European Investment Bank",
    "ticker": "N/A",
    "country": "Luxembourg",
    "sector": "Unknown",
    "industry": "Unknown",
    "enhanced_overview": "European Investment Bank is a major industrial company headquartered in Luxembourg, with expertise in Unknown. The company operates with 0 workforce, providing essential industrial solutions and services to clients across various sectors.",
    "business_overview": "Specializing in Unknown, European Investment Bank delivers comprehensive industrial solutions including manufacturing, engineering services, and specialized equipment. The company serves diverse markets with a focus on quality, innovation, and operational excellence.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  },
  {
    "company_id": "ffd10a7a-6999-4bde-a463-32a205b0fff3",
    "company_name": "Eutelsat Communications SA",
    "ticker": "ETL",
    "country": "France",
    "sector": "Technology",
    "industry": "Communication Equipment",
    "enhanced_overview": "Eutelsat Communications SA is a leading technology company headquartered in France, specializing in Communication Equipment. With approximately 1,514 employees, the company develops innovative solutions and maintains a strong presence in the global technology market.",
    "business_overview": "Operating in the Communication Equipment segment, Eutelsat Communications SA focuses on delivering cutting-edge technology solutions to clients worldwide. The company leverages its expertise and substantial workforce to drive innovation in the technology sector.",
    "source": "Professional Template",
    "last_updated": "2025-08-27T01:01:58.367Z"
  }
]